{
  "metadata": {
    "source": "Wikipedia (MediaWiki API)",
    "fetched_at": "2026-02-02T13:31:23.954317",
    "total_articles": 27
  },
  "articles": [
    {
      "id": "wiki_special_education",
      "title": "Special education",
      "url": "https://en.wikipedia.org/wiki/Special_education",
      "content": "Special education (special ed. or SPED), also known as specialized education, special-needs education, aided education, alternative provision, exceptional student education, or special day class (SDC), is the practice of educating students in a way that accommodates their individual differences, disabilities, and special needs. This involves the individually planned and systematically monitored arrangement of teaching procedures, adapted equipment and materials, and accessible settings. These interventions are designed to help individuals with special needs achieve a higher level of personal self-sufficiency and success in school and in their community, which may not be available if the student were only given access to a typical classroom education.\nSpecial education aims to provide accommodated education for students with disabilities such as learning disabilities, learning difficulties (such as dyslexia), communication disorders, emotional and behavioral disorders, physical disabilities (such as osteogenesis imperfecta, down syndrome, lissencephaly, Sanfilippo syndrome, and muscular dystrophy), developmental disabilities (such as autism spectrum disorder, and intellectual disabilities) and other disabilities. Students with disabilities are likely to benefit from additional educational services such as different approaches to teaching, the use of technology, a specifically adapted teaching area, a resource room, or a separate classroom.\nSome scholars of education may categorize gifted education under the umbrella of \"special education\", but this pedagogical approach is different from special education because of the students' capabilities. Intellectual giftedness is a difference in learning and can also benefit from specialized teaching techniques or different educational programs, but the term \"special education\" is generally used to specifically indicate instruction of disabled students.\nWhereas special education is designed specifically for students with learning disabilities, remedial education can be designed for any students, with or without special needs; the defining trait is simply that they have reached a point of unpreparedness, regardless of why. For example, if a person's education was disrupted, for example, by internal displacement during civil disorder or a war.\nIn the Western world, educators modify teaching methods, curriculum materials, and environments so that the maximum number of students are served in general education environments. Integration can reduce social stigmas and improve academic achievement for many students.\nThe opposite of special education is general education, also known as mainstream education. General education is the standard curriculum presented without special teaching methods or supports. Sometimes special education classrooms and general special education classrooms mix. This is called an inclusive classroom.\n\nHistory\n\nHistory of Special Education\nSpecial education has a long history marked by significant changes in the treatment and education of individuals with disabilities. Over time, efforts to provide equal educational opportunities for all students, regardless of their abilities, have evolved, moving from segregation and exclusion to greater inclusion and integration within general education settings.\nEarly Exclusion and Segregation\nIn the early years, children with disabilities were often excluded from public schools or placed in separate institutions. Many were denied access to education altogether, as societal attitudes often viewed individuals with disabilities as incapable of learning or contributing meaningfully to society. In some cases, children with physical disabilities were given minimal or no education, and those with intellectual disabilities were institutionalized.\nProgress in the Mid-20th Century\nThe mid-20th century saw the beginning of changes in the approach to the education of children with disabilities. The concept of special education started to take shape as schools began to implement separate programs specifically designed to meet the needs of children with disabilities. However, these programs were often isolated, and the children still faced considerable discrimination and limited opportunities for social and academic interaction with their peers.\nThe Individuals with Disabilities Education Act (IDEA) - 1975\nA pivotal moment in the history of special education occurred in the United States with the passing of the Education for All Handicapped Children Act (EAHCA) in 1975, later renamed the Individuals with Disabilities Education Act (IDEA). This landmark legislation, signed into law by President Gerald Ford, mandated that public schools provide free appropriate education (FAPE) to children with disabilities. This law required that schools make necessary accommodations and services to support students with a range of disabilities, including learning disabilities, developmental disabilities, and physical disabilities.\nOne of the key provisions of IDEA was the Least Restrictive Environment (LRE) mandate, which emphasized that children with disabilities should be educated alongside their non-disabled peers to the maximum extent appropriate. This shifted the focus from segregating children with disabilities to providing inclusive educational settings whenever possible.\nInternational and Ongoing Challenges\nAlthough the passage of IDEA marked a major step toward inclusion, global challenges persist. It is estimated that 23 million children with disabilities worldwide still lack access to education, especially in developing countries and rural areas. Many of these children are either excluded from schools or placed in environments that fail to meet their educational needs, exacerbating their vulnerability.\nEfforts to promote the inclusion of children with disabilities in general education settings continue to face barriers such as lack of trained teachers, insufficient resources, and cultural attitudes that may still be resistant to the inclusion of disabled individuals.\nNational Special Needs Day\nTo recognize the ongoing efforts to improve the lives and educational experiences of children with disabilities, National Special Needs Day is observed annually on December 9th. This day is dedicated to raising awareness of the challenges faced by students with disabilities and promoting the principles of inclusion and accessibility in education systems worldwide.\n\nIdentifying students or learners with special needs\nSome children are easily identified as candidates for special needs due to their medical history. For example, they may have been diagnosed with a genetic condition that is associated with intellectual disability, may have various forms of brain damage, may have a developmental disorder, may have visual or hearing disabilities, or other disabilities.\nOn the other hand, for students with less obvious disabilities, such as those who have borderline intellectual disability or specific learning difficulties (dyslexia, dyscalculia, etc.), two primary methods have been used for identifying them: the discrepancy model and the response to intervention model. The discrepancy model depends on the teacher noticing that the students' achievements are noticeably below what is expected, at which point the teacher may make the decision for the student to receive support from a special education specialist. Before doing so, the teacher must show documentation of low academic achievement. The response to intervention model advocates early intervention.\nIn the discrepancy model, a student receives special education services for a specific learning difficulty (SLD) if the student has at least normal intelligence but the student's academic achievement is below what is expected of a student with his or her IQ. Although the discrepancy model has dominated the school system for many years, there has been substantial criticism of this approach (e.g.",
      "summary": "Special education (special ed. or SPED), also known as specialized education, special-needs education, aided education, alternative provision, exceptional student education, or special day class (SDC), is the practice of educating students in a way that accommodates their individual differences, disabilities, and special needs. This involves the individually planned and systematically monitored arrangement of teaching procedures, adapted equipment and materials, and accessible settings. These in...",
      "categories": [
        "All Wikipedia articles needing clarification",
        "All articles containing potentially dated statements",
        "All articles needing additional references",
        "All articles with dead external links",
        "All articles with specifically marked weasel-worded phrases",
        "All articles with unsourced statements",
        "Alternative education",
        "Articles containing Dutch-language text",
        "Articles containing French-language text",
        "Articles containing German-language text",
        "Articles containing Japanese-language text",
        "Articles containing Spanish-language text",
        "Articles containing Swedish-language text",
        "Articles containing potentially dated statements from 2019",
        "Articles needing additional references from May 2022",
        "Articles needing additional references from October 2016",
        "Articles with dead external links from November 2016",
        "Articles with limited geographic scope from June 2022",
        "Articles with multiple maintenance issues",
        "Articles with permanently dead external links"
      ],
      "source_type": "wikipedia",
      "disability_categories": [
        "autism",
        "adhd",
        "learning_disabilities",
        "emotional_behavioral",
        "intellectual"
      ],
      "fetched_at": "2026-02-02T13:30:41.405288"
    },
    {
      "id": "wiki_individualized_education_program",
      "title": "Individualized Education Program",
      "url": "https://en.wikipedia.org/wiki/Individualized_Education_Program",
      "content": "An Individualized Education Program (IEP) is a legal document under United States law that is developed for each public school child in the U.S. who needs special education. IEPs must be reviewed every year to keep track of the child's educational progress. Similar legal documents exist in other countries.\nAn IEP highlights the special education experience for all eligible students with a disability. It also outlines specific strategies and supports to help students with disabilities succeed in both academic and social aspects of school life. An eligible student is any child in the U.S. between the ages of 3–21 attending a public school and has been evaluated as having a need in the form of a specific learning disability, autism, emotional disturbance, other health impairments, intellectual disability, orthopedic impairment, multiple disabilities, hearing impairments, deafness, visual impairment, deaf-blindness, developmental delay, speech/language impairment, or traumatic brain injury. The IEP describes present levels of performance, strengths, and needs, and creates measurable goals based on this data. It provides accommodations, modifications, related services, and specialized academic instruction to ensure that every eligible child receives a \"Free Appropriate Public Education\" (FAPE) in the \"Least Restrictive Environment\" (LRE). The IEP is intended to help children reach educational goals more easily than they otherwise would. The four component goals are: conditions, learner, behavior, and criteria. In all cases, the IEP must be tailored to the individual student's needs as identified by the IEP evaluation process, and must help teachers and related service providers (such as paraprofessional educators) understand the student's disability and how the disability affects the learning process.\nThe IEP describes how the student learns, how the student best demonstrates that learning, and what teachers and service providers will do to help the student learn more effectively. Developing an IEP requires the team to evaluate the student in all areas of disability, consider the student's ability to access the general education curriculum, consider how the disability affects the student's learning, and choose a federal placement for the student.\n\nLegal basis\nIn the US, the Individuals with Disabilities Education Act (IDEA) requires public schools to develop an IEP for every student with a disability who is found to meet the federal and state requirements for special education. As long as a student qualifies for special education, the IEP is mandated to be regularly maintained and updated up to the point of high school graduation or prior to the 21st or 22nd birthday. If a student in special education attends university upon graduation, they are no longer \"children with disabilities\" under the Individuals with Disabilities Education Improvement Act of 2004 and are instead protected under Section 504 of the Rehabilitation Act.\n\nIEP components\nThe IEP must be designed to provide the child with a Free Appropriate Public Education (FAPE). The term IEP refers to both the educational program provided to a child with a disability and to the written document that describes that educational program. The IDEA requires that an IEP be written according to the needs of each student who is eligible under the IDEA; an IEP must also meet state regulations. The following must be included:\n\nThe student's present levels of academic achievement and functional performance (PLAAFP) is an essential component of the IEP.\nMeasurable annual goals, including academic and functional goals\nHow the student's progress toward meeting annual goals is to be measured and reported to the parents\nSpecial-education and related services, as well as supplementary aids to be provided to the student\nSchedule of services to be provided, including when the services are to begin, the frequency, duration, and location for the provision of services\nProgram accommodations or supports provided to school personnel on behalf of the student\nLeast Restrictive Environment (LRE) data which includes calculations of the amount of time to be spent each day by the student in general-education settings compared to special-education settings. LRE requires that students with disabilities be educated with their non-disabled peers as much as possible and that schools must provide justification for any placement outside the general education classroom.\nExplanation of any time the student will not participate along with non-disabled children\nAccommodations to be provided during state and district assessments that are necessary to measuring the student's academic and functional performance\nAn IEP must also include other pertinent information found necessary by the team, such as a health plan or a behavior plan for some students.\n\nAccommodation\n\nSome of a student's educational needs may be met using class accommodations. Accommodations are typically provided by general educators within the general education environment. Accommodations do not involve modifying the material's content but rather allows students to receive information or to demonstrate what they have learned in ways that work around their impairment, thereby minimizing the likelihood of a significant disability. Furthermore, an accommodation enables a student to complete the same assignment as their peers, but with adjustments in areas such as timing, format, setting, schedule, response method, or presentation. For example, a child may complete fewer/different parts of a homework assignment or an assessment than other students. They may also write shorter papers or be given different projects and assignments in replacement of the original task.\nAccommodations may also include provisions such as preferential seating, providing photocopies of teacher notes, giving oral rather than written quizzes, extended time for tests and assignments, use of a word processor or laptop, taking tests in a quiet room, prompts and reminders for focus breaks for sensory needs, and assistance with specific subject areas.\n\nModifications\n\nModifications in the curriculum can occur if a student needs to learn material that the class has moved on from, like working on exponents while the class is moving on to applying them in the order of operations. In other words, a modification changes the lesson or what the student needs to learn. Modifications involves adjusting the curriculum. They also may occur in grading rubrics, where a student with an IEP may be assessed on different standards than other students.\nModifications can be made to the program's content, such as lowering criteria for academic success, decreasing alternative state assessments, such as off-grade level assessments, or allowing the student to receive a \"focused grade\"—a grade that is recognized in a high school diploma, but is noted as \"focused\".\n\nSpecially designed instruction\nSpecially designed instruction affects the instructional content, method of instructional delivery, and the performance methods and criteria that are necessary to help the student make meaningful educational progress. This instruction is designed by or with an appropriately credentialed special education teacher or related service provider. Students may have better success with small-group instruction as presented in a resource room (mandated by program and placement outlined in the IEP) particularly with language-based instruction.\nFor some students, teachers may need to present information through the use of manipulatives. For other students, teachers may need to select and teach only important key concepts and then alter evaluation activities and criteria to match this content change.\nThe IEP team determines whether a specific type of instruction is included in a student's IEP. Generally, if the methodology is an essential part of what is required to meet the individualized needs of the student, the methodology is included.",
      "summary": "An Individualized Education Program (IEP) is a legal document under United States law that is developed for each public school child in the U.S. who needs special education. IEPs must be reviewed every year to keep track of the child's educational progress. Similar legal documents exist in other countries.\nAn IEP highlights the special education experience for all eligible students with a disability. It also outlines specific strategies and supports to help students with disabilities succeed in ...",
      "categories": [
        "All articles needing additional references",
        "All articles with dead external links",
        "All articles with unsourced statements",
        "Articles containing Kazakh-language text",
        "Articles containing Russian-language text",
        "Articles needing additional references from May 2020",
        "Articles with dead external links from December 2023",
        "Articles with permanently dead external links",
        "Articles with short description",
        "Articles with unsourced statements from November 2024",
        "High School Diploma",
        "Short description is different from Wikidata",
        "Special education in the United States"
      ],
      "source_type": "wikipedia",
      "disability_categories": [
        "autism",
        "learning_disabilities",
        "emotional_behavioral",
        "intellectual"
      ],
      "fetched_at": "2026-02-02T13:30:42.905086"
    },
    {
      "id": "wiki_response_to_intervention",
      "title": "Response to Intervention",
      "url": "https://en.wikipedia.org/wiki/Response_to_Intervention",
      "content": "In education, Response to Intervention (RTI or RtI) is an academic approach used to provide early, systematic, and appropriately intensive supplemental instruction and support to children who are at risk of or currently performing below grade or age level standards. However, to better reflect the transition toward a more comprehensive approach to intervention, there has been a shift in recent years from the terminology referring to RTI to MTSS, which stands for \"multi-tiered system of supports\". MTSS represents the latest intervention framework that is being implemented to systematically meet the wider needs which influence student learning and performance.\n\nDescription\nThe RTI approach encompasses tiered levels of support and interventions to adequately meet students' academic needs. It was originally developed as a method for supporting students who appear below-grade level in demonstrating academic skills and identifying students with learning disabilities. However, there has been a shift in the labeling of RTI in schools and professional literature that reflects its adoption as one of the approaches contained within the broader Multi-Tiered System of Supports (MTSS). \nWithin the RTI process that is embedded within the MTSS framework, instruction is differentiated using varying tiers of intervention, progress monitoring of students' performance, and flexible groupings to meet the academic needs of students. The level of support that is provided to individual students intensifies as the tiers increase in number. \nTier 1 intervention is the broadest tier of support that is provided to all general education students and covers core content and grade-level standards. Instruction and the academic supports provided in this tier should be differentiated to meet students' needs and learning styles. \nStudents who appear below-grade level on academic screening assessments will often qualify for Tier 2 intervention, which typically involves evidence-based interventions focused on specific content or skills, and some instruction in a small-group setting. \nStudents who continue to perform below grade level on benchmark assessments, and show little to no response to the Tier 2 interventions, may then be found eligible for Tier 3 intervention, which consists of either small-group, or in some cases one-to-one, instruction. Those who do not advance after receiving Tier 3 intervention(s) typically qualify for a referral to special education.\nUsing a tiered approach to intervention helps schools to determine students' specific instructional levels and inform instructional support. Through administering educational assessments and conducting a critical analysis of the data collected, schools can provide academic support to students at an appropriate level of intensity under the RTI framework.\n\nAssessment and Intervention\nStandardized universal screeners and regular progress monitoring assessments are used to evaluate students' proficiency in core knowledge and skills (e.g., reading, mathematics), as well as determine any necessary modifications to the instruction or appropriate interventions for those appearing as below grade level. \nUniversal screening tools are brief standardized assessments given to all students to identify those at risk of falling below grade-level. In a similar way, more comprehensive \"benchmark\" standardized assessments are also administered in many schools at the beginning, middle, and end of the school year to measure students' proficiency levels on grade-level knowledge and skills in math and language arts. Using both screeners and benchmark assessments helps to systematically identify those needing additional support who may appear below grade level, or are at risk of falling below grade level, and plan appropriate interventions. \nStudents in Tiers 2 and 3 are often evaluated more frequently using progress monitoring assessments to assess students' progress and inform adjustments to the instruction. \n\nComparison to MTSS\nWhereas RTI focuses primarily on meeting the academic needs of students, MTSS takes into account other factors which influence student performance. A study of the nationwide implementation of MTSS reflected that many states in the U.S. are integrating MTSS to provide services to students with learning disabilities, English Language Learners, and academically advanced students. MTSS offers educators a data-based approach to assessing students' current levels of academic performance and providing targeted interventions, while also aiming to promote their holistic growth.\nThe systematic shift toward MTSS in schools provides educators with a framework that allows them to target a more diverse range of students' academic, behavioral, and social-emotional needs by using data to inform intensive instructional supports and interventions. MTSS has been adopted nationally as an umbrella term to reference a multi-tiered and more whole-child approach to meeting students' learning needs and supporting all areas of their development. Whereas RTI focuses on providing tiered academic interventions, MTSS delivers a more comprehensive approach. As MTSS integrates components of both the RTI and Positive Behavioral Interventions and Supports (PBIS) frameworks, it produces challenges for schools to successfully balance and employ to improve student outcomes. However, when implemented with fidelity and uses of best practices to support students across grade levels and subject areas, this framework can yield positive academic and behavioral results.\n\nReasons for Implementation\nThe rationale of response to intervention is to provide all students the additional time and support necessary to learn and perform at high levels. The RTI process within MTSS can help to identify students who are at-risk, inform any adjustments needed to the instruction, monitor students' progress, and inform other necessary interventions.\nThere are at least four main reasons for implementing RTI to address the academic needs of students: \n\nTo increase achievement for all students\nTo reduce racial and ethnic disproportionate representation of minority students in special education\nTo increase collaboration and integration of general and special education\nTo identify students with learning disabilities through a different lens than the IQ-achievement discrepancy model\nA study which evaluated the effects of supplemental reading interventions within MTSS and RTI initiatives found that when Tier 2 interventions are implemented with high levels of fidelity, consistency, and intensity, it is possible for students' reading outcomes to improve. The study reinforced existing research on the effectiveness of Tier 2 intervention in improving student reading performance in schools with low reading achievements levels across varying school districts. Some specific ways students improve in RTI programs improve include the development self-concepts of themselves as readers and improved reading fluency skills. Reading improvements from RTI interventions have been found in students from different socioeconomic, racial, and intellectual quotient groups.\nWhen MTSS is implemented with fidelity, schools can comprehensively support the academic performance of students by providing social-emotional and behavioral supports to address non-academic issues that impact their learning. The MTSS framework is also very useful when working with students who have severe emotional struggles. The intervention and evaluation process for RTI encompassed by MTSS can help this particular group of students to be successful in the academic environment.\n\nFidelity of Implementation\nFor an RTI/MTSS model to be effective, the assessments and interventions must be delivered with fidelity.",
      "summary": "In education, Response to Intervention (RTI or RtI) is an academic approach used to provide early, systematic, and appropriately intensive supplemental instruction and support to children who are at risk of or currently performing below grade or age level standards. However, to better reflect the transition toward a more comprehensive approach to intervention, there has been a shift in recent years from the terminology referring to RTI to MTSS, which stands for \"multi-tiered system of supports\"....",
      "categories": [
        "Articles with short description",
        "CS1 maint: multiple names: authors list",
        "Education policy",
        "Educational assessment and evaluation",
        "Short description matches Wikidata",
        "Special education"
      ],
      "source_type": "wikipedia",
      "disability_categories": [
        "learning_disabilities"
      ],
      "fetched_at": "2026-02-02T13:30:44.366362"
    },
    {
      "id": "wiki_individuals_with_disabilities_education_act",
      "title": "Individuals with Disabilities Education Act",
      "url": "https://en.wikipedia.org/wiki/Individuals_with_Disabilities_Education_Act",
      "content": "The Individuals with Disabilities Education Act (IDEA) is a piece of American legislation that ensures students with a disability are provided with a Free Appropriate Public Education (FAPE) that is tailored to their individual needs. IDEA was previously known as the Education for All Handicapped Children Act (EHA) from 1975 to 1990. In 1990, the United States Congress reauthorized EHA and changed the title to IDEA. Overall, the goal of IDEA is to provide children with disabilities the same opportunity for education as those students who do not have a disability.\nIDEA is composed of four parts, the main two being part A and part B. Part A covers the general provisions of the law; Part B covers assistance for education of all children with disabilities; Part C covers infants and toddlers with disabilities, including children from birth to age three; and Part D consists of the national support programs administered at the federal level. Each part of the law has remained largely the same since the original enactment in 1975.\nIn practice, IDEA is composed of six main elements that illuminate its main points. These six elements are: Individualized Education Program (IEP); Free and Appropriate Public Education (FAPE); Least Restrictive Environment (LRE); Appropriate Evaluation; Parent and Teacher Participation; and Procedural Safeguards. To go along with those six main elements, there are also a few other important components that tie into IDEA: Confidentiality of Information, Transition Services, and Discipline. Throughout the years of IDEA's being reauthorized, these components have become key concepts when learning about IDEA.\n\nBackground and historical context\n\nHistorical context\nIn 1954, the established educational format in the United States of segregating black and white students into separate schools was declared unconstitutional by the United States Supreme Court in Brown v. Board of Education of Topeka. This declaration caused a great deal of unrest in the political sphere and marked a gateway moment in the Civil Rights Movement. Education was an important aspect of the Civil Rights Movement.\nThe 1960s and early 1970s were marked by strife in the United States, from the assassination of John F. Kennedy in 1963 to the Vietnam war ongoing from 1955 until 1975. On top of those events, the Civil Rights Movement was in full force in the United States. From schools being integrated to the Montgomery bus boycott, from Greensboro sit-ins to marches on Washington, equal rights for all was a prevalent ideal. President John F. Kennedy showed interest in cognitive impairment studies and President Lyndon Johnson used Federal funds to increase research on \"at-risk\" youth. Early intervention programs for children living in low socioeconomic situations, such as the Head Start Program, began showing up around the country. Education was soon at the forefront of many political agendas.\nAs of the early 1970s, U.S. public schools accommodated 1 out of 5 children with disabilities. Until that time, many states had laws that explicitly excluded children with certain types of disabilities from attending public school, including children who were blind, deaf, and children labeled \"emotionally disturbed\" or \"mentally retarded.\" At the time, 3.5 million disabled children attended school but were \"warehoused\" in segregated facilities and received little or no effective instruction. More than 1 million children had no access to the public school system, with many of them living at state institutions where they received limited or no educational or rehabilitation services. About 75% of deaf or blind children attended state institutions.\n\nEducation for Handicapped Children (1975)\n\nThe first legislation to provide relief was the Rehabilitation Act of 1973.\nCongress then enacted the Education for All Handicapped Children Act in 1975 to alleviate the financial burden created by litigation pursuant to the Rehabilitation Act. Public schools were required to evaluate children with disabilities and create an educational plan with parent input so as to emulate as closely as possible the educational experience of non-disabled students. Students should be placed in the least restrictive environment, one that allows the maximum possible opportunity to interact with non-impaired students. Separate schooling may occur only when the nature or severity of the disability is such that instructional goals cannot be achieved in the regular classroom. Finally, the law contains a due-process clause that guarantees an impartial hearing to resolve conflicts between the parents of disabled children and the school system.\nThe act also required that school districts provide administrative procedures so that parents of disabled children could dispute decisions made about their children's education. Once the administrative efforts were exhausted, parents were then authorized to seek judicial review of the administration's decision.\n\nIDEA (1990)\nIn 1990, the Individuals with Disabilities Education Act replaced the EHA in order to place more focus on the individual, as opposed to a condition that individual may have. The IDEA also had many improvements on the EHA, such as promoting research and technology development, details on transition programs for students post-high school and programs that educate children in their neighborhood schools, as opposed to separate schools.\nBy 2003, only 25% of deaf or blind children were educated at state institutions.\nAs of 2006, more than 6 million children in the U.S. received special education services through IDEA.\n\nSix pillars of IDEA\n\nIndividualized Education Program (IEP)\n\nThe IDEA requires that public schools create an Individualized Education Program (IEP) for each student who is found to be eligible under both the federal and state eligibility/disability standards. The IEP describes the student's present levels of academic achievement and functional performance, and how the student's disabilities affect or would affect the child's involvement in the general education curriculum. The IEP also specifies the services to be provided and how often, and it specifies accommodations and modifications to be provided for the student.\nThe U.S. Supreme Court has described the IEP as \"the centerpiece of the statute's education delivery system for disabled children\". Honig v. Doe, 484 U.S. 305, 311 (1988)\nThe IEP is the \"basis for the handicapped child's entitlement to an individualized and appropriate education,\" and the school system must design the IEP \"to meet the unique needs of each child with a disability.\" Phillip C. v. Jefferson County Bd. of Educ., 701 F. 3d 691, 694 (11th Cir. 2012), citing Doe v. Ala. State Dep't of Educ., 915 F.2d 651, 654 (11th Cir. 1990) and Winkelman v. Parma City Sch. Dist., 550 U.S. 516, 524 (2007). An IEP must be designed to meet the unique educational needs of that child in the Least Restrictive Environment appropriate to the needs of that child.\nWhen a child qualifies for services, an IEP team is convened to design an education plan. In addition to the child's parents, the IEP team must include at least: \n\none of the child's regular education teachers (if applicable);\na special education teacher;\nsomeone who can interpret the educational implications of the child's evaluation, such as a school psychologist;\nany related service personnel deemed appropriate or necessary; and\nan administrator or CSE (Committee of Special Education) representative who has adequate knowledge of the availability of services in the district and the authority to commit those services on behalf of the child.\nParents are considered to be equal members of the IEP team along with the school staff. Based on the full educational evaluation results, this team collaborates to write for the individual child an IEP that will provide a free, appropriate public education.",
      "summary": "The Individuals with Disabilities Education Act (IDEA) is a piece of American legislation that ensures students with a disability are provided with a Free Appropriate Public Education (FAPE) that is tailored to their individual needs. IDEA was previously known as the Education for All Handicapped Children Act (EHA) from 1975 to 1990. In 1990, the United States Congress reauthorized EHA and changed the title to IDEA. Overall, the goal of IDEA is to provide children with disabilities the same oppo...",
      "categories": [
        "2004 in education",
        "Acts of the 105th United States Congress",
        "Acts of the 108th United States Congress",
        "All Wikipedia articles written in American English",
        "All articles with dead external links",
        "All articles with unsourced statements",
        "Anti-discrimination law in the United States",
        "Articles with dead external links from April 2018",
        "Articles with permanently dead external links",
        "Articles with short description",
        "Articles with unsourced statements from July 2019",
        "CS1: unfit URL",
        "CS1 maint: archived copy as title",
        "Short description matches Wikidata",
        "Special education in the United States",
        "United States federal disability legislation",
        "United States federal education legislation",
        "Use American English from April 2019",
        "Use mdy dates from May 2012",
        "Webarchive template wayback links"
      ],
      "source_type": "wikipedia",
      "disability_categories": [
        "learning_disabilities"
      ],
      "fetched_at": "2026-02-02T13:30:46.044712"
    },
    {
      "id": "wiki_section_504_of_the_rehabilitation_act",
      "title": "Section 504 of the Rehabilitation Act",
      "url": "https://en.wikipedia.org/wiki/Section_504_of_the_Rehabilitation_Act",
      "content": "Section 504 of the Rehabilitation Act of 1973 is American legislation that guarantees certain rights to people with disabilities. It requires that people with disabilities are able to take part in all programs that receive federal funding, while being free from discrimination. It was one of the first U.S. federal civil rights laws that offered legal protections for people with disabilities. Section 504 set precedents for subsequent legislation expanding the rights of people with disabilities, and kickstarted a political movement by in the United States for people with disabilities, resulting in the passage of the Americans with Disabilities Act in 1990.\n\nSummary of the Section\nSection 504 of the Rehabilitation Act of 1973 states (in part):\n\nNo otherwise qualified individual with a disability in the United States, as defined in section 705(20) of this title, shall, solely by reason of her or his disability, be excluded from the participation in, be denied the benefits of, or be subjected to discrimination under any program or activity receiving federal financial assistance or under any program or activity conducted by any Executive agency or by the United States Postal Service.\nIt is Pub. L. No. 93-112, 87 Stat. 394 (Sept. 26, 1973), codified at 29 U.S.C. § 794 et seq.\nAs amended in 1974, Section 111, Pub L. 93-516, 88 Stat. 1619 (Dec. 7, 1974), Individuals with Disabilities are:\n\nAny person who (a) has a physical or mental impairment which substantially limits one or more of such person's major life activities, (b) has a record of such an impairment, or (c) is regarded as having such an impairment\nwhere\n\nMajor life activities include caring for one's self, walking, seeing, hearing, speaking, breathing, working, performing manual tasks, and learning.\nHowever, \"For purposes of employment\", Qualified Individuals with Disabilities must also meet \"normal and essential eligibility requirements\", such that:\n\nFor purposes of employment, Qualified Individuals with Disabilities are persons who, with Reasonable Accommodation, can perform the essential functions of the job for which they have applied or have been hired to perform.\nwhere\n\nReasonable Accommodation means an employer is required to take reasonable steps to accommodate [one's] disability unless it would cause the employer undue hardship.\nThat is, Qualified Individuals with Disabilities must be able to perform the job duties associated with the job for which they would be hired. The United States Department of Labor also indicates that \"Small Providers\" do not have to make \"significant structural alterations to their existing facilities\" to accommodate individuals with disabilities.\nThe ADA Americans with Disabilities Act of 1990 seems to pick up where the Rehabilitation Act left off. Borrowing from the §504 definition of disabled person, and using the familiar three-pronged approach to eligibility (has a physical or mental impairment, a record of an impairment, or is regarded as having an impairment), the ADA applied those standards to most private sector businesses, and sought to eliminate barriers to disabled access in buildings, transportation, and communication. To a large degree, the passage of the ADA supplants the employment provisions of §504, reinforces the accessibility requirements of §504 with more specific regulations\".\n\nImplications\nSection 504 covers \"any program or activity receiving federal financial assistance.\" If an organization receives federal support of any kind, even if the organization is not a federal or state organization, the organization must comply with Section 504. For example, airports in the United States can be at least partially funded by grants from federal and state governments, thus must be compliant. In many communities, public libraries receive federal financial assistance, directly or indirectly, so they must comply as well. Airports and public libraries became accessible according to Section 504 stipulation within a few years of the implementation of Section 504.\n\nRequirements for educational programs\n\nK–12 schools\nThe law also pertains to any \"local educational agency (as defined in section 8801 of Title 20), system of vocational education, or other school system\". As applied to K–12 schools, \"the language broadly prohibits the denial of public education participation, or enjoyment of the benefits offered by public school programs because of a child's disability.\" Although the Individuals with Disabilities Education Act (IDEA) also applies to K-12 schools, the existence of IDEA does not mean the Rehabilitation Act is superfluous. IDEA only protects a subset of children and youth who have disabilities—those who satisfy its definition for \"child with a disability\", which is limited to thirteen types of disabilities. The definition of disability under Section 504 is broader than that of the Individuals with Disabilities Education Act, so some children who do not meet the IDEA definition of disability can still be served under Section 504.\nSection 504 requires school districts to provide Free Appropriate Public Education (FAPE) to children with disabilities, who may benefit from public education, within the individual district's jurisdiction. Regardless of the child's disability, the school district must identify the child's educational needs and provide any regular or special education to satisfy the child's educational needs just as well as it does for the children without disabilities. This may be accomplished by developing an education plan for the child. When done so under Section 504 of the Rehabilitation Act, it is referred to as a 504 plan. This 504 plan covers accommodations, services, and support the child will be receiving in order to have access to education at school. A 504 plan is different and less detailed than an Individualized Education Program (IEPs).\nSection 504 supports rights for students for needs outside of the school day, such as extracurricular activities, sports, and after-school care, because Section 504 prohibits discrimination on the basis of disability. While the process for accommodating students varies per institution, schools generally comply with Section 504 by identifying students with disabilities and evaluating those students. If the students are eligible, they create a written accommodation plan, often called a \"504 Plan.\" It is similar to, but often shorter than, the IDEA Individualized Education Program (IEP). Parents, teachers, and school staff are a part of the process. Parents have due process rights; where they disagree with the determinations of the school, they have a right to an impartial hearing.\nViolations of Section 504 in the educational environment can be addressed locally with the education agency or with the Office for Civil Rights (OCR) of the U.S. Department of Education. Violations of Section 504 can result in a loss of the federal funding. According to the Department individuals may also file a private right of action for violations of Sec. 504. Thus, Section 504 is enforced by OCR. IDEA is carried out by another unit of the department, the Office of Special Education Programs (OSEP).\n\nExtracurricular activity\nSection 504 covers extracurricular and after school programs such as sports, music lessons, and afterschool care. 34 C.F.R. § 104.37.\nThe Department of Education Office of Civil Rights has determined that Section 504 applies to:\n\nPlaygrounds - Hazleton (Pennsylvania) Area School District, 17 EHLR 907 (OCR, March 7, 1991); San Francisco (California) Unified Sch. Dist., 23 IDELR 1200 (OCR, November 26, 1995); Mill Valley (CA) Elementary Sch. Dist., 23 IDELR 1190 (OCR, October 10, 1995);\nBand programs - Akron (Ohio) City Sch., 19 IDELR 793 (OCR, January 15, 1993);\nSpecial programs and assemblies - Whitman-Hanson (Massachusetts) Regional Sch. Dist., 20 IDELR 775 (OCR, August 19, 1993); Atlanta (Georgia) Pub. Sch.",
      "summary": "Section 504 of the Rehabilitation Act of 1973 is American legislation that guarantees certain rights to people with disabilities. It requires that people with disabilities are able to take part in all programs that receive federal funding, while being free from discrimination. It was one of the first U.S. federal civil rights laws that offered legal protections for people with disabilities. Section 504 set precedents for subsequent legislation expanding the rights of people with disabilities, an...",
      "categories": [
        "1973 in American law",
        "All Wikipedia articles written in American English",
        "All articles covered by WikiProject Wikify",
        "All articles with dead external links",
        "All articles with unsourced statements",
        "All pages needing cleanup",
        "Articles covered by WikiProject Wikify from March 2023",
        "Articles with dead external links from May 2025",
        "Articles with short description",
        "Articles with unsourced statements from January 2017",
        "Articles with unsourced statements from November 2025",
        "Articles with unsourced statements from October 2022",
        "Articles with unsourced statements from September 2016",
        "Disability in law",
        "Disability in the United States",
        "Disability law in the United States",
        "Short description is different from Wikidata",
        "Special education in the United States",
        "United States disability legislation",
        "United States federal civil rights legislation"
      ],
      "source_type": "wikipedia",
      "disability_categories": [
        "emotional_behavioral"
      ],
      "fetched_at": "2026-02-02T13:30:47.510554"
    },
    {
      "id": "wiki_universal_design_for_learning",
      "title": "Universal Design for Learning",
      "url": "https://en.wikipedia.org/wiki/Universal_Design_for_Learning",
      "content": "Universal Design for Learning (UDL) is an educational framework based on research in the learning theory, including cognitive neuroscience, that guides the development of flexible learning environments and learning spaces that can accommodate individual learning differences.\nUniversal Design for learning is a set of principles that provide teachers with a structure to develop instructions to meet the diverse needs of all learners.\nThe UDL framework, first defined by David H. Rose, Ed.D. of the Harvard Graduate School of Education and the Center for Applied Special Technology (CAST) in the 1990s, calls for creating a curriculum from the outset that provides:\n\nMultiple means of representation give learners various ways of acquiring information and knowledge,\nMultiple means of expression to provide learners alternatives for demonstrating what they know, and\nMultiple means of engagement to tap into learners' interests, challenge them appropriately, and motivate them to learn.\nCurriculum, as defined in the UDL literature, has four parts: instructional goals, methods, materials, and assessments. UDL is intended to increase access to learning by reducing physical, cognitive, intellectual, and organizational barriers to learning, as well as other obstacles. UDL principles also lend themselves to implementing inclusionary practices in the classroom.\nUniversal Design for Learning is referred to by name in American legislation, such as the Higher Education Opportunity Act (HEOA) of 2008 (Public Law 110-315), the 2004 reauthorization of the Individuals with Disabilities Education Act (IDEA), and the Assistive Technology Act of 1998. The emphasis is placed on equal access to curriculum by all students and the accountability required by IDEA 2004 and No Child Left Behind legislation has presented a need for a practice that will accommodate all learners.\n\nOrigins\nThe concept and language of Universal Design for Learning was inspired by the universal design movement in architecture and product development, originally formulated by Ronald L. Mace at North Carolina State University. Universal design calls for \"the design of products and environments to be usable by all people, to the greatest extent possible, without the need for adaptation or specialized design\". UDL applies this general idea to learning: that curriculum should, from the outset, be designed to accommodate all kinds of learners. Educators have to be deliberate in the teaching and learning process in the classroom (e.g., Preparing class learning profiles for each student). This will enable grouping by interest. Those students that have challenges will be given special assistance. This will enable specific multimedia to meet the needs of all students. \nHowever, recognizing that the UD principles created to guide the design of things (e.g., buildings, products) are not adequate for the design of social interactions (e.g., human learning environments), researchers at CAST looked to the neurosciences and theories of progressive education in developing the UDL principles. In particular, the work of Lev Vygotsky and, less directly, Benjamin Bloom informed the three-part UDL framework.\nSome educational initiatives, such as Universal Design for Instruction (UDI) and Universal Instructional Design (UID), adapt the Mace principles for products and environments to learning environments, primarily at the postsecondary level. While these initiatives are similar to UDL, and have, in some cases, compatible goals, they are not equivalent to UDL and the terms are not interchangeable; they refer to distinct frameworks. On the other hand, UDI practices promoted by the DO-IT Center operationalize both UD and UDL principles to help educators maximize the learning of all students.\n\nImplementation initiatives in the US\nIn 2006, representatives from more than two dozen educational and disability organizations in the US formed the National Universal Design for Learning Taskforce. The goal was to raise awareness of UDL among national, state, and local policymakers.\nThe organizations represented in the National Task Force on UDL include the National School Boards Association, the National Education Association (NEA), the American Federation of Teachers (AFT), the National Association of State Directors of Special Education (NASDSE), the Council of Chief State School Officers (CCSSO), the National Down Syndrome Society (NDSS), the Council for Learning Disabilities (CLD), the Council for Exceptional Children (CEC), the National Center for Learning Disabilities (NCLD), the National Association of Secondary School Principals (NASSP), Easter Seals, American Foundation for the Blind (AFB), Association on Higher Education and Disability, Higher Education Consortium for Special Education (HECSE), American Occupational Therapy Association, National Association of State Boards of Education (NASBE), National Down Syndrome Congress (NDSC), Learning Disabilities Association of America (LDA), TASH, the Arc of the United States, the Vocational Evaluation and Career Assessment Professionals Association (VECAP), the National Cerebral Palsy Association, and the Advocacy Institute.\nActivities have included sponsoring a Congressional staff briefing on UDL in February 2007 and supporting efforts to include UDL in major education legislation for both K–12 and postsecondary.\n\nResearch\nResearch evidence on UDL is complicated as it is hard to isolate UDL from other pedagogical practices, for example, Coppola et al. (2019) combine UDL with Culturally Sustaining Pedagogy, and Phuong and Berkeley (2017) combine it with Adaptive Equity Oriented Pedagogy (AEP). Coppola et al. provide phenomenological evidence that learners with a variety of needs find UDL helpful for their learning. Phuong and Berkeley, using a randomized controlled trial, found that AEP, which is based on UDL, led to a significant improvement in students’ grades, even when several confounding variables were controlled for.\nBaumann and Melle (2019) report in a small-scale study of 89 students, 73 without specific educational needs and 16 with specific educational needs, that the inclusion of UDL enhanced both students’ performance and their enjoyment of the learning experience.\n\nAssistive technology for UDL\nAssistive technology (AT) is a pedagogical approach that can be used to enforce universal design for learning (UDL) in the inclusive classroom. AT and UDL can be theorized as two ends of a spectrum, where AT is on one end addressing personal or individual student needs, and UDL is on the other end concerned with classroom needs and curriculum design. Around the center of this spectrum, AT and UDL overlap such that student individual needs are addressed within the context of the larger curriculum, ideally without segregation or exclusion. UDL provides educators with the framework for an educational curriculum that addresses students' diverse learning styles and interests via AT.\nAccording to the Technology-Related Assistance to Individuals with Disabilities Act of 1988 and the Individuals with Disabilities Education Act of 2004, AT includes AT devices and services. AT devices are physical hardware, equipment, or software used to improve a person's cognitive, emotional, and/or behavioral experience. These devices differ from medical ones which may be implanted surgically. AT services aid a person in choosing and/or using AT devices.\n\nTypes of assistive technology\n\nLow-tech\nAssistive technology devices can be characterized as low-tech, mid-tech, or high-tech. Low-tech devices are low in cost and students who use them do not usually need to participate in training. Low-tech devices include graphic organizers, visual aids, grid or stylized paper, and pencil grips, among others. Low-tech AT would be a first step in addressing a student's needs.",
      "summary": "Universal Design for Learning (UDL) is an educational framework based on research in the learning theory, including cognitive neuroscience, that guides the development of flexible learning environments and learning spaces that can accommodate individual learning differences.\nUniversal Design for learning is a set of principles that provide teachers with a structure to develop instructions to meet the diverse needs of all learners.\nThe UDL framework, first defined by David H. Rose, Ed.D. of the H...",
      "categories": [
        "All articles with dead external links",
        "All articles with unsourced statements",
        "Articles with dead external links from June 2020",
        "Articles with short description",
        "Articles with unsourced statements from June 2020",
        "Higher education",
        "Pedagogy",
        "Short description is different from Wikidata"
      ],
      "source_type": "wikipedia",
      "disability_categories": [
        "learning_disabilities"
      ],
      "fetched_at": "2026-02-02T13:30:48.921973"
    },
    {
      "id": "wiki_inclusion_education",
      "title": "Inclusion (education)",
      "url": "https://en.wikipedia.org/wiki/Inclusion_(education)",
      "content": "Inclusion in education refers to including all students to equal access to equal opportunities of education and learning, and is distinct from educational equality or educational equity. It arose in the context of special education with an individualized education program or 504 plan, and is built on the notion that it is more effective for students with special needs to have the said mixed experience for them to be more successful in social interactions leading to further success in life. The philosophy behind the implementation of the inclusion model does not prioritize, but still provides for the utilization of special classrooms and special schools for the education of students with disabilities. Inclusive education models are brought into force by educational administrators with the intention of moving away from seclusion models of special education to the fullest extent practical, the idea being that it is to the social benefit of general education students and special education students alike, with the more able students serving as peer models and those less able serving as motivation for general education students to learn empathy.\nImplementation of these practices varies. Schools most frequently use the inclusion model for select students with mild to moderate special needs. Fully inclusive schools, which are rare, do not separate \"general education\" and \"special education\" programs; instead, the school is restructured so that all students learn together.\nInclusive education differs from the 'integration' or 'mainstreaming' model of education, which tended to be a concern.\nA premium is placed upon full participation by students with disabilities and upon respect for their social, civil, and educational rights. Feeling included is not limited to physical and cognitive disabilities, but also includes the full range of human diversity with respect to ability, language, culture, gender, age and of other forms of human differences. Richard Wilkinson and Kate Pickett wrote, \"student performance and behaviour in educational tasks can be profoundly affected by the way we feel, we are seen and judged by others. When we expect to be viewed as inferior, our abilities seem to diminish\". This is why the United Nations Sustainable Development Goal 4 recognizes the need for adequate physical infrastructures and the need for safe, inclusive learning environments.\n\nIntegration and mainstreaming\nInclusion has different historical roots/background which may be integration of students with severe disabilities in the US (who may previously been excluded from schools or even lived in institutions) or an inclusion model from Canada and the US (e.g., Syracuse University, New York) which is very popular with inclusion teachers who believe in participatory learning, cooperative learning, and inclusive classrooms.\nInclusive education differs from the early university professor's work (e.g., 1970s, Education Professor Carol Berrigan of Syracuse University, 1985; Douglas Biklen, Dean of School of Education through 2011) in integration and mainstreaming which were taught throughout the world including in international seminars in Italy. Mainstreaming (e.g., the Human Policy Press poster; If you thought the wheel was a good idea, you'll like the ramp) tended to be concerned about \"readiness\" of all parties for the new coming together of students with significant needs. Thus, integration and mainstreaming principally was concerned about disability and 'special educational needs' (since the children were not in the regular schools) and involved teachers, students, principals, administrators, School Boards, and parents changing and becoming 'ready for' students who needed accommodation or new methods of curriculum and instruction (e.g., required federal IEPs – individualized education program) by the mainstream.\nBy contrast, inclusion is about the child's right to participate and the school's duty to accept the child returning to the US Supreme Court's Brown vs. the Board of Education decision and the new Individuals with Disabilities Education (Improvement) Act (IDEIA). Inclusion rejects the use of special schools or classrooms, which remain popular among large multi-service providers, to separate students with disabilities from students without disabilities. A premium is placed upon full participation by students with disabilities, in contrast to earlier concept of partial participation in the mainstream, and upon respect for their social, civil, and educational rights. Inclusion gives students with disabilities skills they can use in and out of the classroom.\n\nPrinciples and necessary resources\nAlthough once hailed as a way to increase achievement while decreasing costs, full inclusion does not save money. It is not designed to reduce students' needs, and its first priority may not even be to improve academic outcomes; in most cases, it merely moves the special education professionals (now dual certified for all students in some states) out of \"their own special education\" classrooms and into a corner of the general classroom or as otherwise designed by the \"teacher-in-charge\" and \"administrator-in-charge\". To avoid harm to the academic education of students with disabilities, a full panoply of services and resources is required (of education for itself), including:\n\nAdequate supports and services for the student\nWell-designed individualized education programs\nProfessional development for all teachers involved, general and special educators alike\nTime for teachers to plan, meet, create, and evaluate the students together\nReduced class size based on the severity of the student needs\nProfessional skill development in the areas of cooperative learning, peer tutoring, adaptive curriculum\nCollaboration between parents or guardians, teachers or para educators, specialists, administration, and outside agencies.\nSufficient funding so that schools will be able to develop programs for students based on student need instead of the availability of funding.\nIndeed, the students with special needs do receive funds from the federal government, by law originally the Educational for All Handicapped Children Act of 1974 to the present day, Individuals with Disabilities Education Improvement Act, which requires its use in the most integrated setting.\n\nCommon practices in inclusive classrooms\n\nStudents in an inclusive classroom are generally placed with their chronological age-mates, regardless of whether the students are working above or below the typical academic level for their age. Also, to encourage a sense of belonging, emphasis is placed on the value of friendships. Teachers often nurture a relationship between a student with special needs and a same-age student without a special educational need. Another common practice is the assignment of a buddy to accompany a student with special needs at all times (for example in the cafeteria, on the playground, on the bus and so on). This is used to show students that a diverse group of people make up a community, that no one type of student is better than another, and to remove any barriers to a friendship that may occur if a student is viewed as \"helpless.\" Such practices reduce the chance for elitism among students in later grades and encourage cooperation among groups.\nTeachers use a number of techniques to help build classroom communities:\n\nUsing games designed to build community\nInvolving students in solving problems\nSharing songs and books that teach community\nOpenly dealing with individual differences by discussion\nAssigning classroom jobs that build community\nTeaching students to look for ways to help each other\nUtilizing physical therapy equipment such as standing frames, so students who typically use wheelchairs can stand when the other students are standing and more actively participate in activities\nEncouraging students to take the role of teacher and deliver instruction (e.g.",
      "summary": "Inclusion in education refers to including all students to equal access to equal opportunities of education and learning, and is distinct from educational equality or educational equity. It arose in the context of special education with an individualized education program or 504 plan, and is built on the notion that it is more effective for students with special needs to have the said mixed experience for them to be more successful in social interactions leading to further success in life. The p...",
      "categories": [
        "Accessibility",
        "All articles with unsourced statements",
        "Articles with limited geographic scope from February 2018",
        "Articles with short description",
        "Articles with specifically marked weasel-worded phrases from August 2016",
        "Articles with unsourced statements from November 2024",
        "CS1 errors: bare URL",
        "CS1 errors: missing title",
        "CS1 maint: location missing publisher",
        "Critical pedagogy",
        "Education policy",
        "Education reform",
        "Educational environment",
        "Educational psychology",
        "Philosophy of education",
        "Segregation",
        "Short description is different from Wikidata",
        "Social inclusion",
        "Special education",
        "Webarchive template wayback links"
      ],
      "source_type": "wikipedia",
      "disability_categories": [
        "learning_disabilities",
        "intellectual"
      ],
      "fetched_at": "2026-02-02T13:30:50.475685"
    },
    {
      "id": "wiki_autism_spectrum_disorder",
      "title": "Autism",
      "url": "https://en.wikipedia.org/wiki/Autism",
      "content": "Autism, also known as autism spectrum disorder (ASD), is a condition characterized by differences or difficulties in social communication and interaction, a need or strong preference for predictability and routine, sensory processing differences, focused interests, or repetitive behaviors. Features of autism are present from early childhood and the condition typically persists throughout life. Autism is classified as a neurodevelopmental disorder, and a formal diagnosis requires professional assessment that these characteristics cause significant challenges in daily life beyond what is expected given a person's age and social environment. Because autism is a spectrum disorder, presentations vary and support needs range from minimal to the person being non-speaking or needing 24-hour care.\nAutism diagnoses have risen since the 1990s, largely because of broader diagnostic criteria, greater awareness, and wider access to assessment. Changing social demands may also play a role. The World Health Organization estimates that about 1 in 100 children were diagnosed between 2012 and 2021, noting an increasing trend. Surveillance studies suggest a similar share of the adult population would meet diagnostic criteria if formally assessed. Autism is highly heritable and involves many genes, while environmental factors appear to play a smaller, mainly prenatal role. Boys are diagnosed several times more often than girls, with girls being better at hiding autistic traits. Conditions such as anxiety, depression, attention deficit hyperactivity disorder (ADHD), epilepsy, as well as intellectual disability, are more common among autistic people. Certain savant abilities are also more common in autistic people than in other groups.\nThere is no cure for autism. Several autism therapies aim to improve self-care, social, and language skills. Reducing environmental and social barriers helps autistic people participate more fully in education, employment, and other aspects of life. No medication addresses the core features of autism, but some are used to help manage commonly co-occurring conditions, such as anxiety, depression, irritability, ADHD, and epilepsy.\nAutistic people are found in every demographic group and, with appropriate supports that promote independence and self-determination, can participate fully in their communities and lead meaningful, productive lives. The idea of autism as a disorder has been challenged by the neurodiversity framework, which frames autistic traits as a healthy variation of the human condition. This perspective, promoted by the autism rights movement, has attracted increasing research attention, but is debated and remains controversial among autistic people, advocacy groups, healthcare providers, and charities.\n\nSigns and characteristics\nAutism is primarily characterized by differences and difficulties in social interaction and communication, alongside restricted or repetitive patterns of interests, activities, or behaviors (stimming), and, in many cases, distinctive reactions to sensory input. The specific presentation varies widely. Clinicians often consider assessment for autism when these characteristics are present, especially if they are associated with difficulty obtaining or sustaining employment or education, difficulty initiating or maintaining social relationships, involvement with mental health or learning disability services, or a history of neurodevelopmental conditions (including learning disabilities and ADHD) or mental health conditions. In most cases, signs of autism are first observable in infancy or early childhood and remain throughout life. Autistic people may be significantly disabled in some respects, but average—or, in some cases, superior—in others.\n\nSocial and communication skills\nAutistic people may have differences in social communication and interaction, which can lead to challenges in environments structured around non-autistic norms. Current diagnostic criteria for autism require difficulties across three social domains: social-emotional reciprocity, nonverbal communication, and developing and maintaining relationships.\n\nSocial–emotional reciprocity\nCommon early signs of autism include little or no babbling in infancy. Difficulties may also be apparent in traditional forms of reciprocal social interaction, such as games like peek-a-boo or pat-a-cake, as well as in shared attention to objects of interest. Historically, autistic children were said to be delayed in developing a theory of mind, and the empathizing–systemizing theory proposed that while autistic people may have compassion (affective empathy) for others with similar autistic traits, they often have limited, though not necessarily absent, cognitive empathy. This may present as social naïvety, lower-than-average intuitive perception of the meaning or utility of body language, social reciprocity, or social expectations, including the habitus, social cues, and certain aspects of sarcasm, which to some degree may be influenced by co-occurring alexithymia.\nRecent research has increasingly questioned these earlier interpretations, as the double empathy problem theory (2012) proposes that misunderstandings arise mutually between autistic and non-autistic people, rather than solely from autistic deficits in empathy or social cognition. This perspective has contributed to a growing recognition that autistic behavior and communication may reflect different, rather than deficient, social behavior and communication styles. Autistic interests and conversational styles are often characterized by a strong focus on specific topics, a phenomenon known as monotropism.\n\nNonverbal communication\nAutistic people often display atypical behaviors or differences in nonverbal communication. Some may make infrequent eye contact, even when called by name, or avoid it altogether because they find it uncomfortable, distracting, or overstimulating. They may recognize fewer emotions or interpret facial expressions differently, and may not respond with expressions expected by their non-autistic peers. They can also have difficulty inferring social context or subtext in conversation or text, resulting in different interpretations of meaning. Speech characteristics such as volume, rhythm, and intonation (prosody) can vary, and atypical prosody is estimated to occur in at least half of autistic children. \n\nDeveloping and sustaining relationships\nSigns of autism in childhood include less apparent interest in other children or caregivers, possibly with more interest in objects. Behaviors that may appear as indifference to non-autistic people often reflect autistic differences in recognizing others' personalities, perspectives, and interests. Most research has focused on interpersonal relationship difficulties between autistic and non-autistic people and on teaching social skills to address these gaps. But newer studies indicate that autistic people often form satisfying relationships with other autistic people, which can enhance quality of life. \nChildren on the autism spectrum are more likely than their non-autistic peers to be involved in bullying, most often as victims. Among autistic people who seek friendships, reduced friendship quantity and quality are often associated with increased loneliness. Autistic people also face greater challenges in developing romantic relationships than non-autistic people. \nOver time, many autistic people learn to observe and form models of social patterns, and develop coping strategies, such as \"masking\". Masking is associated with poorer mental health outcomes as well as delayed diagnosis, which can limit access to appropriate supports.\n\nRestricted and repetitive behaviors\n\nThe second core feature of autism is a pattern of restricted and repetitive behaviors, activities, and interests.",
      "summary": "Autism, also known as autism spectrum disorder (ASD), is a condition characterized by differences or difficulties in social communication and interaction, a need or strong preference for predictability and routine, sensory processing differences, focused interests, or repetitive behaviors. Features of autism are present from early childhood and the condition typically persists throughout life. Autism is classified as a neurodevelopmental disorder, and a formal diagnosis requires professional ass...",
      "categories": [
        "All Wikipedia articles written in American English",
        "All articles that are too technical",
        "All articles to be expanded",
        "All articles with unsourced statements",
        "All pages needing factual verification",
        "Articles intentionally citing publications with errata",
        "Articles to be expanded from August 2025",
        "Articles to be expanded from July 2025",
        "Articles with short description",
        "Articles with unsourced statements from July 2025",
        "Autism",
        "CS1 Swedish-language sources (sv)",
        "CS1 location test",
        "CS1 maint: work parameter with ISBN",
        "Developmental psychology",
        "Learning disabilities",
        "Pages using Sister project links with hidden wikidata",
        "Pages using multiple image with auto scaled images",
        "Short description is different from Wikidata",
        "Use American English from June 2025"
      ],
      "source_type": "wikipedia",
      "disability_categories": [
        "autism",
        "adhd",
        "learning_disabilities",
        "sensory_processing",
        "intellectual"
      ],
      "fetched_at": "2026-02-02T13:30:52.028540"
    },
    {
      "id": "wiki_attention_deficit_hyperactivity_disorder",
      "title": "Attention deficit hyperactivity disorder",
      "url": "https://en.wikipedia.org/wiki/Attention_deficit_hyperactivity_disorder",
      "content": "Attention deficit hyperactivity disorder (ADHD) is a neurodevelopmental disorder characterised by symptoms of inattention, hyperactivity, impulsivity, and emotional dysregulation that are excessive and pervasive, impairing in multiple contexts, and developmentally inappropriate. ADHD symptoms arise from executive dysfunction.\nImpairments resulting from deficits in self-regulation such as time management, cognitive inhibition, task initiation, and sustained attention can include poor professional performance, relationship difficulties, and numerous health risks, collectively predisposing to a diminished quality of life and a reduction in life expectancy. It is associated with other mental disorders as well as non-psychiatric disorders, which can cause additional impairment.\nWhile ADHD involves a lack of sustained attention to tasks, inhibitory deficits also can lead to difficulty interrupting an already ongoing response pattern, manifesting in the perseveration of actions despite a change in context whereby the individual intends the termination of those actions. This symptom is known colloquially as hyperfocus and is related to risks such as addiction and types of offending behaviour. ADHD can be difficult to tell apart from other conditions. ADHD represents the extreme lower end of the continuous dimensional trait (bell curve) of executive functioning and self-regulation, which is supported by twin, brain imaging and molecular genetic studies.\nThe precise causes of ADHD are unknown in most individual cases. Meta-analyses have shown that the disorder is primarily genetic with a heritability rate of 70–80%, where risk factors are highly accumulative. The environmental risks are not related to social or familial factors; they exert their effects very early in life, in the prenatal or early postnatal period. However, in rare cases, ADHD can be caused by a single event including traumatic brain injury, exposure to biohazards during pregnancy, or a major genetic mutation. As it is a neurodevelopmental disorder, there is no biologically distinct adult-onset ADHD except for when ADHD occurs after traumatic brain injury.\n\nSigns and symptoms\nInattention, hyperactivity (restlessness in adults), disruptive behaviour, and impulsivity are common in ADHD. Academic difficulties are frequent, as are problems with relationships. A diagnosis can be hard to ascertain, as it is hard to distinguish between normal levels of symptoms and levels that cause significant impairment in major life activities.\nAccording to the fifth edition of the Diagnostic and Statistical Manual of Mental Disorders (DSM-5) and its text revision (DSM-5-TR), symptoms must be present for six months or more to a degree that is much greater than others of the same age. This requires at least six symptoms of either inattention or hyperactivity/impulsivity for those under 17 and at least five symptoms for those 17 years or older. The symptoms must be present in at least two settings (e.g., social, school, work, or home), and must directly interfere with or reduce quality of functioning. Additionally, several symptoms must have been present before age 12 as per DSM-5 criteria. However, research indicates the age of onset should not be interpreted as a prerequisite for diagnosis given contextual exceptions.\n\nPresentations\nADHD is divided into three primary presentations:\n\npredominantly inattentive (ADHD-PI or ADHD-I)\npredominantly hyperactive-impulsive (ADHD-PH or ADHD-HI)\ncombined presentation (ADHD-C).\nThe table \"Symptoms\" lists the symptoms for ADHD-I and ADHD-HI from two major classification systems. Symptoms which can be better explained by another psychiatric or medical condition which an individual has are not considered to be a symptom of ADHD for that person. In DSM-5, subtypes were discarded and reclassified as presentations of the disorder that change over time.\n\nGirls and women with ADHD tend to display fewer hyperactivity and impulsivity symptoms but more symptoms of inattention and distractibility.\nSymptoms are expressed differently and more subtly as the individual ages. Hyperactivity tends to become less overt with age and turns into inner restlessness, difficulty relaxing or remaining still, talkativeness or constant mental activity in teens and adults with ADHD. Impulsivity in adulthood may appear as thoughtless behaviour, impatience, irresponsible spending and sensation-seeking behaviours, while inattention may appear as becoming easily bored, difficulty with organisation, remaining on task and making decisions, and sensitivity to stress.\n\nCharacteristics in childhood\nDifficulties managing anger are more common in children with ADHD, as are delays in speech, language and motor development. Poorer handwriting is more common in children with ADHD. Poor handwriting can be a symptom of ADHD in itself due to decreased attentiveness. When this is a pervasive problem, it may also be attributable to dyslexia or dysgraphia. There is significant overlap in the symptomatologies of ADHD, dyslexia, and dysgraphia, and 3 in 10 people diagnosed with dyslexia experience co-occurring ADHD. Although it causes significant difficulty, many children with ADHD have an attention span equal to or greater than that of other children for tasks and subjects they find interesting.\n\nEmotional dysregulation\nAlthough not listed as an official symptom, emotional dysregulation or mood lability is generally understood to be a common symptom of ADHD.\n\nRelationship difficulties\nPeople with ADHD of all ages are more likely to have problems with social skills, such as social interaction and forming and maintaining friendships. This is true for all presentations. About half of children and adolescents with ADHD experience social rejection by their peers compared to 10–15% of non-ADHD children and adolescents. People with attention deficits are prone to having difficulty processing verbal and nonverbal language which can negatively affect social interaction. They may also drift off during conversations, miss social cues, and have trouble learning social skills.\n\nHyperfocus\n\nAn association between ADHD and hyperfocus, a state characterised by intense and narrow concentration on a specific stimulus, object or task for a prolonged period of time, has been widely reported in the popular science press and media. The phenomenon generally occurs when an individual is engaged in activities they find highly interesting, or which provide instant gratification, such as video games or online chatting. Hyperfocus is not a recognised symptom of ADHD in diagnostic manuals, but is frequently referred to as a symptom of ADHD in academic literature and commonly reported in patients with ADHD in clinical practice. There is a lack of research into hyperfocus in ADHD. Studies in 2016, 2019 and 2024 found that individuals with ADHD diagnoses or self-reported ADHD symptoms experience hyperfocus more often, or more acutely. A 2020 study did not find a higher frequency of hyperfocus in adults with ADHD, although it reported a positive correlation with self-reported ADHD traits. The discrepancy with other studies may reflect varying definitions and conceptions of hyperfocus.\nA state of hyperfocus has been hypothesised as being beneficial, allowing individuals to focus on tasks for much longer than is typical. Conversely, it can be difficult to disengage from and shift attention to other stimuli or tasks, leading to excessively prolonged attention. It is related to risks such as internet addiction (see § Problematic digital media use) and to some types of offending behaviour. Recent research has linked hyperfocus to the psychological concepts of flow, an enjoyable experience of deep engagement in an activity, and perseveration, difficulty disengaging or switching from an activity.\n\nIQ test performance\nCertain studies have found that people with ADHD tend to have lower scores on intelligence quotient (IQ) tests.",
      "summary": "Attention deficit hyperactivity disorder (ADHD) is a neurodevelopmental disorder characterised by symptoms of inattention, hyperactivity, impulsivity, and emotional dysregulation that are excessive and pervasive, impairing in multiple contexts, and developmentally inappropriate. ADHD symptoms arise from executive dysfunction.\nImpairments resulting from deficits in self-regulation such as time management, cognitive inhibition, task initiation, and sustained attention can include poor professional...",
      "categories": [
        "1987 neologisms",
        "Ailments of unknown cause",
        "All Wikipedia articles in need of updating",
        "All Wikipedia articles written in British English",
        "All articles containing potentially dated statements",
        "All articles with vague or ambiguous time",
        "All pages needing factual verification",
        "Amphetamine",
        "Articles containing potentially dated statements from 2010",
        "Articles containing potentially dated statements from 2019",
        "Articles with excerpts",
        "Articles with short description",
        "Attention deficit hyperactivity disorder",
        "Attention disorders",
        "CS1: long volume value",
        "CS1 French-language sources (fr)",
        "CS1 German-language sources (de)",
        "CS1 Spanish-language sources (es)",
        "CS1 maint: DOI inactive as of February 2026",
        "Good articles"
      ],
      "source_type": "wikipedia",
      "disability_categories": [
        "adhd",
        "emotional_behavioral"
      ],
      "fetched_at": "2026-02-02T13:30:53.619133"
    },
    {
      "id": "wiki_dyslexia",
      "title": "Dyslexia",
      "url": "https://en.wikipedia.org/wiki/Dyslexia",
      "content": "Dyslexia, also known as \"word blindness\", is a learning disability that affects either reading or writing. Different people are affected to different degrees. Problems may include difficulties in spelling words, reading quickly, writing words, \"sounding out\" words in the head, pronouncing words when reading aloud and understanding what one reads. Often these difficulties are first noticed at school. The difficulties are involuntary, and people with this disorder have a normal desire to learn. People with dyslexia have higher rates of attention deficit hyperactivity disorder (ADHD), developmental language disorders, and difficulties with numbers.\nDyslexia is believed to be caused by the interaction of genetic and environmental factors. Some cases run in families. Dyslexia that develops due to a traumatic brain injury, stroke, or dementia is sometimes called \"acquired dyslexia\" or alexia. The underlying mechanisms of dyslexia result from differences within the brain's language processing. Dyslexia is diagnosed through a series of tests of memory, vision, spelling, and reading skills. Dyslexia is separate from reading difficulties caused by hearing or vision problems or by insufficient teaching or opportunity to learn.\nTreatment involves adjusting teaching methods to meet the person's needs. While not curing the underlying problem, it may decrease the degree or impact of symptoms. Treatments targeting vision are not effective. Dyslexia is the most common learning disability and occurs in all areas of the world. It affects 3–7% of the population; however, up to 20% of the general population may have some degree of symptoms. While dyslexia is more often diagnosed in boys, this is partly explained by a self-fulfilling referral bias among teachers and professionals. It has even been suggested that the condition affects men and women equally. Some believe that dyslexia is best considered as a different way of learning, with both benefits and downsides.\n\nClassification\n\nDyslexia is divided into developmental and acquired forms. Acquired dyslexia occurs subsequent to neurological insult, such as traumatic brain injury or stroke. People with acquired dyslexia exhibit some of the signs or symptoms of the developmental disorder, but require different assessment strategies and treatment approaches. Pure alexia, also known as agnosic alexia or pure word blindness, is one form of alexia which makes up \"the peripheral dyslexia\" group.\n\nSigns and symptoms\n\nIn early childhood, symptoms that correlate with a later diagnosis of dyslexia include delayed onset of speech and a lack of phonological awareness. A common myth closely associates dyslexia with mirror writing and reading letters or words backwards. These behaviors are seen in many children as they learn to read and write, and are not considered to be defining characteristics of dyslexia.\nSchool-age children with dyslexia may exhibit signs of difficulty in identifying or generating rhyming words, or counting the number of syllables in words—both of which depend on phonological awareness. They may also show difficulty in segmenting words into individual sounds (such as sounding out the three sounds of k, a, and t in cat) or may struggle to blend sounds, indicating reduced phonemic awareness.\nDifficulties with word retrieval or naming things is also associated with dyslexia. People with dyslexia are commonly poor spellers, a feature sometimes called dysorthographia or dysgraphia, which depends on the skill of orthographic coding.\nProblems persist into adolescence and adulthood and may include difficulties with summarizing stories, memorization, reading aloud, or learning foreign languages. Adults with dyslexia can often read with good comprehension, though they tend to read more slowly than others without a learning difficulty and perform worse in spelling tests or when reading nonsense words—a measure of phonological awareness.\n\nAssociated conditions\nDyslexia often co-occurs with other learning disorders, but the reasons for this comorbidity have not been clearly identified. These associated disabilities include:\n\nDysgraphia\nA disorder involving difficulties with writing or typing, sometimes due to problems with eye–hand coordination; it also can impede direction- or sequence-oriented processes, such as tying knots or carrying out repetitive tasks. In dyslexia, dysgraphia is often multifactorial, due to impaired letter-writing automaticity, organizational and elaborative difficulties, and impaired visual word forming, which makes it more difficult to retrieve the visual picture of words required for spelling.\nAttention deficit hyperactivity disorder (ADHD)\nA disorder characterized by problems sustaining attention, hyperactivity, or acting impulsively. Dyslexia and ADHD commonly occur together. Approximately 15% or 12–24% of people with dyslexia have ADHD; and up to 35% of people with ADHD have dyslexia.\nAuditory processing disorder\nA listening disorder that affects the ability to process auditory information. This can lead to problems with auditory memory and auditory sequencing. Many people with dyslexia have auditory processing problems, and may develop their own logographic cues to compensate for this type of deficit. Some research suggests that auditory processing skills could be the primary shortfall in dyslexia.\nDevelopmental coordination disorder\nA neurological condition characterized by difficulty in carrying out routine tasks involving balance, fine-motor control and kinesthetic coordination; difficulty in the use of speech sounds; and problems with short-term memory and organization.\n\nCauses\n\nResearchers have been trying to find the neurobiological basis of dyslexia since the condition was first identified in 1881. For example, some have tried to associate the common problem among people with dyslexia of not being able to see letters clearly to abnormal development of their visual nerve cells.\n\nNeuroanatomy\nNeuroimaging techniques, such as functional magnetic resonance imaging (fMRI) and positron emission tomography (PET), have shown a correlation between both functional and structural differences in the brains of children with reading difficulties. Some people with dyslexia show less activation in parts of the left hemisphere of the brain involved with reading, such as the inferior frontal gyrus, inferior parietal lobule, and the middle and ventral temporal cortex. Meta-analyses of fMRI studies have found under-activation where the temporal and occipital lobes meet in the left hemisphere in dyslexic subjects (including the visual word form area). Over the past decade, brain activation studies using PET to study language have produced a breakthrough in the understanding of the neural basis of language. Neural bases for the visual lexicon and for auditory verbal short-term memory components have been proposed, with some implication that the observed neural manifestation of developmental dyslexia is task-specific (i.e., functional rather than structural). fMRIs of people with dyslexia indicate an interactive role of the cerebellum and cerebral cortex as well as other brain structures in reading.\nThe cerebellar theory of dyslexia proposes that impairment of cerebellum-controlled muscle movement affects the formation of words by the tongue and facial muscles, resulting in the fluency problems that some people with dyslexia experience. The cerebellum is also involved in the automatization of some tasks, such as reading. The fact that some children with dyslexia have motor task and balance impairments could be consistent with a cerebellar role in their reading difficulties. However, the cerebellar theory has not been supported by controlled research studies.\n\nGenetics\nResearch into potential genetic causes of dyslexia has its roots in post-autopsy examination of the brains of people with dyslexia.",
      "summary": "Dyslexia, also known as \"word blindness\", is a learning disability that affects either reading or writing. Different people are affected to different degrees. Problems may include difficulties in spelling words, reading quickly, writing words, \"sounding out\" words in the head, pronouncing words when reading aloud and understanding what one reads. Often these difficulties are first noticed at school. The difficulties are involuntary, and people with this disorder have a normal desire to learn. Pe...",
      "categories": [
        "Articles with hAudio microformats",
        "Articles with short description",
        "CS1 German-language sources (de)",
        "CS1 maint: multiple names: authors list",
        "CS1 maint: others",
        "Commons category link from Wikidata",
        "Dyslexia",
        "Externally peer reviewed articles",
        "Good articles",
        "Learning to read",
        "Literacy",
        "Pages including recorded pronunciations",
        "Pages using the Phonos extension",
        "Reading (process)",
        "Short description is different from Wikidata",
        "Specific developmental disorders",
        "Spoken articles",
        "Use dmy dates from January 2021",
        "Webarchive template wayback links",
        "Wikipedia articles incorporating text from open access publications"
      ],
      "source_type": "wikipedia",
      "disability_categories": [
        "adhd",
        "learning_disabilities"
      ],
      "fetched_at": "2026-02-02T13:30:55.075897"
    },
    {
      "id": "wiki_dyscalculia",
      "title": "Dyscalculia",
      "url": "https://en.wikipedia.org/wiki/Dyscalculia",
      "content": "Dyscalculia is a learning disability resulting in difficulty learning or comprehending arithmetic, such as difficulty in understanding numbers, numeracy, learning how to manipulate numbers, performing mathematical calculations, and learning facts in mathematics. It is sometimes colloquially referred to as \"math dyslexia\", though this analogy can be misleading as they are distinct syndromes.\nDyscalculia is associated with dysfunction in the region around the intraparietal sulcus and potentially also the frontal lobe. Dyscalculia does not reflect a general deficit in cognitive abilities or difficulties with time, measurement, and spatial reasoning. Estimates of the prevalence of dyscalculia range between three and six percent of the population. In 2015, it was established that 11% of children with dyscalculia also have attention deficit hyperactivity disorder (ADHD). Dyscalculia has also been associated with Turner syndrome and people who have spina bifida.\n\nSigns and symptoms\nThe earliest appearance of dyscalculia is typically a deficit in subitizing, which is the ability to know, from a brief glance and without counting, how many objects there are in a small group. Children as young as five can subitize six objects, especially while looking at the dots on the sides of dice. However, children with dyscalculia can subitize fewer objects and, even when correct, take longer to identify the number than their age-matched peers. Dyscalculia often looks different at different ages. It tends to become more apparent as children get older; however, symptoms can appear as early as preschool. Common symptoms of dyscalculia are having difficulty with mental calculation, trouble analyzing time and reading an analog clock, struggle with motor sequencing that involves numbers, and often counting on fingers when adding numbers.\n\nPersistence in children\nAlthough many researchers believe dyscalculia to be a persistent disorder, evidence on the persistence of dyscalculia remains mixed. For instance, in a study done by Mazzocco and Myers (2003), researchers evaluated children on a slew of measures and selected their most consistent measure as their best diagnostic criterion: a stringent 10th-percentile cut-off on the TEMA-2. Even with their best criterion, they found dyscalculia diagnoses for children longitudinally did not persist; only 65% of students who were ever diagnosed over the course of four years were diagnosed for at least two years. The percentage of children who were diagnosed in two consecutive years was further reduced. It is unclear whether this was the result of misdiagnosed children improving in mathematics and spatial awareness as they progressed as normal, or that the subjects who showed improvement were accurately diagnosed, but exhibited signs of a non-persistent learning disability.\n\nPersistence in adults\nThere are very few studies of adults with dyscalculia who have had a history of it growing up, but such studies have shown that it can persist into adulthood. It can affect major parts of an adult's life. Most adults with dyscalculia have a hard time processing mathematics at a 4th-grade level. For 1st–4th grade level, many adults will know what to do for the mathematics problem, but they will often get them wrong because of \"careless errors\", although they are not careless when it comes to the problem. The adults cannot process their errors on the problems or may not even recognize that they have made these errors. Visual-spatial input, auditory input, and touch input will be affected due to these processing errors. Dyscalculics may experience difficulties when adding numbers in a column format. Their mind can mix up the numbers, and it is possible that they may get the same (wrong) answer twice due to their mind processing the problem incorrectly. Dyscalculics can have problems determining differences in different coins and their size or giving the correct amount of change and if numbers are grouped together, it is possible that they cannot determine which has less or more. Dyscalculics are slower and make more mistakes when asked to choose the greater of two numbers, especially when those numbers are close together. Adults with dyscalculia may struggle with directions while driving and with controlling their finances, leading to difficulties on a day-to-day basis.\n\nCollege students or other adult learners\nCollege students particularly may have a difficult time due to the fast pace and change in difficulty of the work they are given. As a result of this, students may develop much anxiety and frustration. After dealing with their anxiety for a long time, students can become averse to mathematics and try to avoid it as much as possible, which may result in lower grades in mathematics courses. Students with dyscalculia, however, can also do exceptionally well in writing, reading, and speaking.\n\nCauses\nBoth domain-general and domain-specific causes have been put forth. With respect to pure developmental dyscalculia, domain-general causes are unlikely as they should not impair one's ability in the numerical domain without also affecting other domains such as reading. However, in favor of domain-general theories, some studies suggested that some other congitive functions as spatial skills, face perception and general working memory could be a predictor of dyscalculia and comorbid dyslexia/dyscalculia.\nTwo competing domain-specific hypotheses about the causes of developmental dyscalculia have been proposed – the magnitude representation (or number module deficit hypothesis) and the access deficit hypothesis.\n\nMagnitude representation deficit\nDehaene's \"number sense\" theory suggests that approximate numerosities are automatically ordered in an ascending manner on a mental number line. The mechanism to represent and process non-symbolic magnitude (e.g., number of dots) is often known as the \"approximate number system\" (ANS), and a core deficit in the precision of the ANS, known as the \"magnitude representation hypothesis\" or \"number module deficit hypothesis\", has been proposed as an underlying cause of developmental dyscalculia.\nIn particular, the structural features of the ANS are theoretically supported by a phenomenon called the \"numerical distance effect\", which has been robustly observed in numerical comparison tasks. Typically developing individuals are less accurate and slower in comparing pairs of numbers closer together (e.g., 7 and 8) than further apart (e.g., 2 and 9). A related \"numerical ratio effect\" (in which the ratio between two numbers varies but the distance is kept constant, e.g., 2 vs. 5 and 4 vs. 7) based on Weber's law has also been used to further support the structure of the ANS. The numerical ratio effect is observed when individuals are less accurate and slower in comparing pairs of numbers that have a larger ratio (e.g., 8 and 9, ratio = 8/9) than a smaller ratio (2 and 3; ratio = 2/3). A larger numerical distance or ratio effect with comparison of sets of objects (i.e., non-symbolic) is thought to reflect a less precise ANS, and ANS acuity has been found to correlate with mathematical achievement in typically developing children and also in adults.\nMore importantly, several behavioral studies have found that children with developmental dyscalculia show an attenuated distance/ratio effect compared with typically developing children. Moreover, neuroimaging studies have also provided additional insights even when behavioral difference in distance/ratio effect might not be clearly evident. For example, Gavin R. Price and colleagues found that children with developmental dyscalculia showed no differential distance effect on reaction time relative to typically developing children, but they did show a greater effect of distance on response accuracy.",
      "summary": "Dyscalculia is a learning disability resulting in difficulty learning or comprehending arithmetic, such as difficulty in understanding numbers, numeracy, learning how to manipulate numbers, performing mathematical calculations, and learning facts in mathematics. It is sometimes colloquially referred to as \"math dyslexia\", though this analogy can be misleading as they are distinct syndromes.\nDyscalculia is associated with dysfunction in the region around the intraparietal sulcus and potentially a...",
      "categories": [
        "1940s neologisms",
        "All articles that may contain original research",
        "All articles with unsourced statements",
        "Arithmetic",
        "Articles containing Ancient Greek (to 1453)-language text",
        "Articles containing Latin-language text",
        "Articles that may contain original research from October 2025",
        "Articles with short description",
        "Articles with unsourced statements from July 2021",
        "Learning disabilities",
        "Mathematics education",
        "Neurodevelopmental disorders",
        "Short description is different from Wikidata",
        "Use dmy dates from August 2021"
      ],
      "source_type": "wikipedia",
      "disability_categories": [
        "adhd",
        "learning_disabilities"
      ],
      "fetched_at": "2026-02-02T13:30:56.817986"
    },
    {
      "id": "wiki_dysgraphia",
      "title": "Dysgraphia",
      "url": "https://en.wikipedia.org/wiki/Dysgraphia",
      "content": "Dysgraphia is a neurological disorder and learning disability that concerns impairments in written expression, which affects the ability to write, primarily handwriting, but also coherence. It is a specific learning disability (SLD) as well as a transcription disability, meaning that it is a writing disorder associated with impaired handwriting, orthographic coding and finger sequencing (the movement of muscles required to write). It often overlaps with other learning disabilities and neurodevelopmental disorders such as speech impairment, attention deficit hyperactivity disorder (ADHD) or developmental coordination disorder (DCD).\nIn the Diagnostic and Statistical Manual of Mental Disorders (DSM-5), dysgraphia is not mentioned. Dyslexia is characterized as a neurodevelopmental disorder under the umbrella category of specific learning disorder.\nDysgraphia should be distinguished from agraphia (sometimes called acquired dysgraphia), which is an acquired loss of the ability to write resulting from brain injury, progressive illness, or a stroke.\n\nEtymology\nThe word dysgraphia comes from the Greek words dys meaning \"impaired\" and γραφία graphía meaning \"writing by hand\".\n\nDevelopment\nThere are at least two stages in the act of writing: the linguistic stage and the motor-expressive-praxic stage. The linguistic stage involves the encoding of auditory and visual information into symbols for letters and written words. This is mediated through the angular gyrus, which provides the linguistic rules which guide writing. The motor stage is where the finger movements to write words or graphemes are articulated. This stage is mediated by Exner's writing area of the frontal lobe.\nThe condition can cause individuals to struggle with feedback and anticipating and exercising control over rhythm and timing throughout the writing process.\nPeople with dysgraphia often write on some level and may experience difficulty with other activities requiring reciprocal movement of their fingers and other fine motor skills, such as; tying shoes, fastening buttons or playing certain musical instruments. However, dysgraphia does not affect all fine motor skills. People with dysgraphia often have unusual difficulty with handwriting and spelling, which in turn can cause writing fatigue. Unlike people without transcription disabilities, they tend to fail to preserve the size and shape of the letters they produce if they cannot look at what they are writing. They may lack basic grammar and spelling skills (for example, having difficulties with the letters p, q, b, and d), and often will write the wrong word when trying to formulate their thoughts on paper. The disorder generally emerges when the child is first introduced to writing. There is accumulating evidence that, in many cases, individuals with SLDs and DCD do not outgrow their disorders. Accordingly, it has been found that adults, teenagers, and children alike are all subject to dysgraphia. Studies have shown that higher education students with developmental dysgraphia still experience significant difficulty with hand writing, fine motor skills and motor-related daily functions when compared to their peers without neurodevelopmental disorders.\n\nClassification\nDysgraphia is nearly always accompanied by other learning disabilities and/or neurodevelopmental disorders such as dyslexia, attention deficit hyperactivity disorder, or oral and written language learning disability (OWL LD) and this can impact the type of dysgraphia a person has. Tourette syndrome, ASD and dyspraxia are also common diagnoses among dysgraphic individuals. Developmental dysgraphia was originally described as being a disorder that occurs solely in dyslexic individuals. Dysgraphia was not studied as a separate entity until mid-20th century when researchers discovered there were different types that occur without dyslexia. Dyslexics and dysgraphics experience similar synchronization difficulties and issues with spelling. However, dyslexia does not seem to impair physical writing ability or dramatically impact fine motor skills and dysgraphia does not impact reading comprehension. Methods for evaluating, managing and remedying dysgraphia are still evolving, but there are three principal subtypes of dysgraphia that are recognized.\n\nDyslexic\nThere are several features that distinguish dyslexic-dysgraphia (sometimes called linguistic dysgraphia) from the other types. People with dyslexic-dysgraphia typically have poor oral and written spelling that is typically phonemic in nature. Their spontaneously written work is often illegible, has extra or deleted syllables or letters, and contains unnecessary capitalization or large spaces in the middle of words which can make each individual word unrecognizable. They may also insert symbols that do not resemble any letter of the alphabet. Writing production generally requires long periods of contemplation and correction.\nDyslexic-dysgraphic individuals have fairly good copied work, and their ability to draw is also preserved. Their finger tapping speed (a method for identifying fine motor problems) is normal, indicating that the deficit does not likely stem from cerebellar damage. Impaired verbal executive functioning has also been related to this form of the disorder.\nOne study found that boys with ADHD and dysgraphia struggle primarily with motor planning rather than have a linguistic impairment but the prevalence of linguistic/dyslexic-dysgraphia compared to other subtypes is uncertain.\n\nMotor\n\nMotor dysgraphia (sometimes called peripheral dysgraphia) is due to deficient fine motor skills, poor dexterity, poor muscle tone or unspecified motor clumsiness. Motor dysgraphia impairs both motor patterns and motor memory. Letter formation may be acceptable in very short samples of writing, but this requires extreme effort and an unreasonable amount of time to accomplish, and it cannot be sustained for a significant length of time, as it can cause arthritis-like tensing of the hand. Overall, their written work is poor to illegible even if copied by sight from another document, and drawing is impaired. Oral spelling for these individuals is normal, and their finger tapping speed is below normal. This shows that there are problems within the fine motor skills of these individuals. People with developmental coordination disorder may be dysgraphic and motor-dysgraphia may serve as a marker of dyspraxia. Motor-dysgraphics struggle with proper finger grip and writing is often slanted due to holding a pen or pencil incorrectly. Average writing speed is slower than that of non-dysgrapic individuals, but this seems to improve with age. Motor skill deficits appears to be a common cause of dysgraphia; a study using digital tablets to measure various components of dysgraphic children's writing found that 78% of children with the disorder present kinematic difficulties, while 58% of them display issues with exerting pressure.\n\nSpatial\nA person with spatial dysgraphia has an impairment in the understanding of space. This impaired spatial perception causes illegible spontaneously written work, illegible copied work, abnormal spacing between letters and majorly impaired drawing abilities. They have normal oral spelling and normal finger tapping speed, suggesting that this subtype is not fine motor based.\n\nDyscravia\nIn 2010, the Dyscravia or voicing substitution dysgraphia subtype was proposed. The subtype presents with differentiated voicing substitution, where individuals make mistakes when transferring from phonemes to graphemes (ie. \"goat\" would be mistakenly written as \"coat\"). Dyscravia does not appear to result from impairments in auditory processing or in speech production.",
      "summary": "Dysgraphia is a neurological disorder and learning disability that concerns impairments in written expression, which affects the ability to write, primarily handwriting, but also coherence. It is a specific learning disability (SLD) as well as a transcription disability, meaning that it is a writing disorder associated with impaired handwriting, orthographic coding and finger sequencing (the movement of muscles required to write). It often overlaps with other learning disabilities and neurodevel...",
      "categories": [
        "Alexia (condition)",
        "All articles with unsourced statements",
        "Articles with limited geographic scope from November 2022",
        "Articles with short description",
        "Articles with unsourced statements from December 2020",
        "CS1 Hungarian-language sources (hu)",
        "Dysgraphia",
        "Learning disabilities",
        "Neurological disorders",
        "Short description is different from Wikidata",
        "Symptoms and signs: Speech and voice",
        "United States-centric"
      ],
      "source_type": "wikipedia",
      "disability_categories": [
        "adhd",
        "learning_disabilities"
      ],
      "fetched_at": "2026-02-02T13:30:58.250896"
    },
    {
      "id": "wiki_learning_disability",
      "title": "Learning disability",
      "url": "https://en.wikipedia.org/wiki/Learning_disability",
      "content": "Learning disability, primary learning disorder, or learning difficulty (British English) is a condition in the brain that causes difficulties comprehending or processing information and can be caused by several different factors. Given the \"difficulty learning in a typical manner\", this does not exclude the ability to learn in a different manner. Therefore, some people can be more accurately described as having a \"learning difference\", thus avoiding any misconception of being disabled with a possible lack of an ability to learn and possible negative stereotyping. In the United Kingdom, the term learning disability generally refers to an intellectual disability, while conditions such as dyslexia and dyspraxia are usually referred to as learning difficulties.\nWhile learning disability and learning disorder are often used interchangeably, they differ in many ways. Disorder refers to significant learning problems in an academic area. These problems, however, are not enough to warrant an official diagnosis. Learning disability, on the other hand, is an official clinical diagnosis, whereby the individual meets certain criteria, as determined by a professional (such as a psychologist, psychiatrist, speech-language pathologist, or paediatrician). The difference is in the degree, frequency, and intensity of reported symptoms and problems, and thus the two should not be confused. When the term \"learning disorder\" is used, it describes a group of disorders characterized by inadequate development of specific academic, language, and speech skills. Types of learning disorders include reading (dyslexia), arithmetic (dyscalculia) and writing (dysgraphia).\nThe unknown factor is the disorder that affects the brain's ability to receive and process information. This disorder can make it problematic for a person to learn as quickly or in the same way as someone who is not affected by a learning disability. People with a learning disability have trouble performing specific types of skills or completing tasks if left to figure things out by themselves or if taught in conventional ways.\nIndividuals with learning disabilities can face unique challenges that are often pervasive throughout the lifespan. Depending on the type and severity of the disability, interventions, and current technologies may be used to help the individual learn strategies that will foster future success. Some interventions can be quite simple, while others are intricate and complex. Current technologies may require student training to be effective classroom supports. Teachers, parents, and schools can create plans together that tailor intervention and accommodations to aid the individuals in successfully becoming independent learners. A multi-disciplinary team frequently helps to design the intervention and to coordinate the execution of the intervention with teachers and parents. This team frequently includes school psychologists, special educators, speech therapists (pathologists), occupational therapists, psychologists, ESL teachers, literacy coaches, and/or reading specialists. \n\nDefinition\nIn the United States, a committee of representatives of organizations committed to the education and welfare of individuals with learning disabilities is known as the National Joint Committee on Learning Disabilities (NJCLD). The NJCLD, founded in 1975, used the term 'learning disability' to indicate a discrepancy between a child's apparent capacity to learn and their level of achievement. Several difficulties existed, however, with the NJCLD standard of defining learning disability. One such difficulty was its belief of central nervous system dysfunction as a basis of understanding and diagnosing learning disability. This conflicted with the fact that many individuals who experienced central nervous system dysfunction, such as those with cerebral palsy, did not experience disabilities in learning. On the other hand, those individuals who experienced multiple handicapping conditions along with learning disability frequently received inappropriate assessment, planning, and instruction. The NJCLD notes that it is possible for learning disability to occur simultaneously with other handicapping conditions, however, the two should not be directly linked together or confused.\n\nIn the 1980s, NJCLD, therefore, defined the term learning disability as: a heterogeneous group of disorders manifested by significant difficulties in the acquisition and use of listening, speaking, reading, writing, reasoning or mathematical abilities. These disorders are intrinsic to the individual and presumed to be due to Central Nervous System Dysfunction. Even though a learning disability may occur concomitantly with other handicapping conditions (e.g. sensory impairment, intellectual disability, social and emotional disturbance) or environmental influences (e.g. cultural differences, insufficient/inappropriate instruction, psychogenic factors) it is not the direct result of those conditions or influences.\nThe 2002 LD Roundtable produced the following definition:Concept of LD: Strong converging evidence supports the validity of the concept of specific learning disabilities (SLD). This evidence is particularly impressive because it converges across different indicators and methodologies. The central concept of SLD involves disorders of learning and cognition that are intrinsic to the individual. SLD are specific in the sense that these disorders each significantly affect a relatively narrow range of academic and performance outcomes. SLD may occur in combination with other disabling conditions, but they are not due primarily to other conditions, such as intellectual disability, behavioral disturbance, lack of opportunities to learn, or primary sensory deficits.The issue of defining learning disabilities has generated significant and ongoing controversy. The term \"learning disability\" does not exist in DSM-IV, but it has been added to the DSM-5. The DSM-5 does not limit learning disorders to a particular diagnosis such as reading, mathematics, or written expression. Instead, it is a single diagnosis criterion describing drawbacks in general academic skills and includes detailed specifiers for the areas of reading, mathematics, and written expression.\n\nUnited States and Canada\nIn the United States and Canada, the terms learning disability and learning disorder (LD) refer to a group of disorders that affect a broad range of academic and functional skills including the ability to speak, listen, read, write, spell, reason, organize information, and do math. People with learning disabilities may have average or higher intelligence. Awareness of the need to help college students compensate for learning disabilities spread across US college campuses during the 1990s. During this time, facing legal and institutional pressures, faculty members began providing accommodations for larger numbers of students in their courses.\n\nLegislation in the United States\nThe Section 504 of the Rehabilitation Act 1973, effective May 1977, guarantees certain rights to people with disabilities, especially in the cases of education and work, such being in schools, colleges and university settings.\nThe Individuals with Disabilities Education Act, formerly known as the Education for All Handicapped Children Act, is a United States federal law that governs how states and public agencies provide early intervention, special education and related services to children with disabilities. It addresses the educational needs of children with disabilities from birth to the age of 21. Considered as a civil rights law, states are not required to participate.\n\nPolicymaking in Canada\nIn Canada, the first association in support of children with learning disabilities was founded in 1962 by a group of concerned parents.",
      "summary": "Learning disability, primary learning disorder, or learning difficulty (British English) is a condition in the brain that causes difficulties comprehending or processing information and can be caused by several different factors. Given the \"difficulty learning in a typical manner\", this does not exclude the ability to learn in a different manner. Therefore, some people can be more accurately described as having a \"learning difference\", thus avoiding any misconception of being disabled with a pos...",
      "categories": [
        "All Wikipedia articles in need of updating",
        "All articles lacking reliable references",
        "All articles needing additional references",
        "All articles with incomplete citations",
        "All articles with specifically marked weasel-worded phrases",
        "All articles with unsourced statements",
        "Articles lacking reliable references from July 2025",
        "Articles needing additional medical references from July 2025",
        "Articles needing additional references from August 2021",
        "Articles requiring reliable medical sources",
        "Articles with incomplete citations from September 2016",
        "Articles with limited geographic scope from September 2025",
        "Articles with multiple maintenance issues",
        "Articles with obsolete information from July 2025",
        "Articles with short description",
        "Articles with specifically marked weasel-worded phrases from July 2025",
        "Articles with unsourced statements from August 2021",
        "Articles with unsourced statements from July 2025",
        "CS1 errors: periodical ignored",
        "CS1 maint: work parameter with ISBN"
      ],
      "source_type": "wikipedia",
      "disability_categories": [
        "learning_disabilities",
        "intellectual"
      ],
      "fetched_at": "2026-02-02T13:30:59.791843"
    },
    {
      "id": "wiki_intellectual_disability",
      "title": "Intellectual disability",
      "url": "https://en.wikipedia.org/wiki/Intellectual_disability",
      "content": "Intellectual disability (ID), also known as general learning disability (in the United Kingdom), and formerly as mental retardation (in the United States), is a generalized neurodevelopmental disorder characterized by significant impairment in intellectual and adaptive functioning that is first apparent during childhood. Children with intellectual disability typically have an intelligence quotient (IQ) below 70 and deficits in at least two adaptive behaviors that affect everyday living. According to the DSM-5, intellectual functions include reasoning, problem solving, planning, abstract thinking, judgment, academic learning, and learning from experience. Deficits in these functions must be confirmed by clinical evaluation and individualized standard IQ testing. On the other hand, adaptive behaviors include the social, developmental, and practical skills people learn to perform tasks in their everyday lives. Deficits in adaptive functioning often compromise an individual's independence and ability to meet their social responsibility.\nIntellectual disability is subdivided into syndromic intellectual disability, in which intellectual deficits associated with other medical and behavioral signs and symptoms are present, and non-syndromic intellectual disability, in which intellectual deficits appear without other abnormalities. Down syndrome and fragile X syndrome are examples of syndromic intellectual disabilities.\nIntellectual disability affects about 2–3% of the general population. Seventy-five to ninety percent of the affected people have mild intellectual disability. Non-syndromic, or idiopathic cases account for 30–50% of these cases. About a quarter of cases are caused by a genetic disorder, and about 5% of cases are inherited. Cases of unknown cause affect about 95 million people as of 2013.\n\nSigns and symptoms\nIntellectual disability (ID) becomes apparent during childhood, and involves deficits in mental abilities, social skills, and core activities of daily living (ADLs) when compared to peers of the same age. There are often no physical signs of mild forms of ID, although there may be characteristic physical traits when it is associated with a genetic disorder (e.g. Down syndrome).\nThe level of impairment ranges in severity for each person. Some of the early signs can include:\n\nDelays in reaching, or failure to achieve milestones in motor skills development (sitting, crawling, walking)\nSlowness learning to talk, or continued difficulties with speech and language skills after starting to talk\nDifficulty with self-help and self-care skills (e.g., getting dressed, washing, and feeding themselves)\nPoor planning or problem-solving abilities\nBehavioral and social problems\nFailure to grow intellectually, or continued infant childlike behavior\nProblems keeping up in school\nFailure to adapt or adjust to new situations\nDifficulty understanding and following social rules\nIn early childhood, mild ID (IQ 50–69) may not be obvious or identified until children begin school. Even when poor academic performance is recognized, it may take expert assessment to distinguish mild intellectual disability from specific learning disability or emotional/behavioral disorders. People with mild ID are capable of learning reading and mathematics skills to approximately the level of a typical child aged nine to twelve. They can learn self-care and practical skills, such as cooking or using the local transit system. As individuals with intellectual disabilities reach adulthood, many learn to live independently and maintain gainful employment. About 85% of people with ID are likely to have mild ID.\nModerate ID (IQ 35–49) is almost always apparent within the first years of life. Speech delays are particularly common signs of moderate ID. People with moderate intellectual disabilities need considerable support in school, at home, and in the community in order to fully participate. While their academic potential is limited, they can learn simple health and safety skills and to participate in simple activities. As adults, they may live with their parents, in a supportive group home, or even semi-independently with significant supportive services to help them, for example, to manage their finances. As adults, they may work in a sheltered workshop. About 10% of people with ID are likely to have moderate ID.\nPeople with Severe ID (IQ 20–34), accounting for 3.5% of persons with ID, or Profound ID (IQ 19 or below), accounting for 1.5% of people with ID, need more intensive support and supervision for their entire lives. They may learn some ADLs, but an intellectual disability is considered severe or profound when individuals are unable to independently care for themselves without ongoing significant assistance from a caregiver throughout adulthood. Individuals with profound ID are completely dependent on others for all ADLs and to maintain their physical health and safety. They may be able to learn to participate in some of these activities to a limited degree.\n\nCo-morbidity\n\nAutism and intellectual disability\nIntellectual disability and autism spectrum disorder (ASD) share clinical characteristics which can result in confusion while diagnosing. Overlapping these two disorders, while common, can be detrimental to a person's well-being. Differentiating between these two disorders will allow clinicians to deliver or prescribe the appropriate treatments, though comorbidity between ID and ASD is very common; roughly 30% of those with ASD also have ID. Both ASD and ID require shortfalls in communication and social awareness as defining criteria.\nIn a study conducted in 2016 surveying 2816 cases, it was found that the top subsets that help differentiate between those with ID and ASD are, \"impaired non-verbal social behavior and lack of social reciprocity, [...] restricted interests, strict adherence to routines, stereotyped and repetitive motor mannerisms, and preoccupation with parts of objects\". Those with ASD tend to show more deficits in non-verbal social behavior such as body language and understanding social cues. In a study done in 2008 of 336 individuals with varying levels of ID, it was found that those with ID display fewer instances of repetitive or ritualistic behaviors. It also recognized that those with ASD, when compared to those with ID, were more likely to isolate themselves and make less eye contact. When it comes to classification ID and ASD have very different guidelines. ID has a standardized assessment called the Supports Intensity Scale (SIS); this measures severity on a system built around how much support an individual will need. While ASD also classifies severity by support needed, there is no standard assessment; clinicians are free to diagnose severity at their own judgment.\n\nEpilepsy and intellectual disability\nAround 22% of individuals with ID have epilepsy. The incidence of epilepsy is associated with level of ID; epilepsy affects around half of individuals with profound ID. Proper epilepsy management is particularly crucial in this population, as individuals are at increased risk of sudden unexpected death in epilepsy. Nonetheless, epilepsy management in the ID population can be challenging due to high levels of polypharmacy prescribing, drug interactions, and increased vulnerability to adverse effects. It is thought that 70% of individuals with ID are pharmaco-resistant, however only around 10% of individuals are prescribed anti-seizure medications (ASMs) licensed for pharmaco-resistant epilepsy. Research shows that certain ASMs, including levetiracetam and brivaracetam, show similar efficacy and tolerability in individuals with ID as compared to those without. There is much ongoing research into epilepsy management in the ID population.\n\nCauses\n\nAmong children, the cause of intellectual disability is unknown for one-third to one-half of cases. About 5% of cases are inherited.",
      "summary": "Intellectual disability (ID), also known as general learning disability (in the United Kingdom), and formerly as mental retardation (in the United States), is a generalized neurodevelopmental disorder characterized by significant impairment in intellectual and adaptive functioning that is first apparent during childhood. Children with intellectual disability typically have an intelligence quotient (IQ) below 70 and deficits in at least two adaptive behaviors that affect everyday living. Accordin...",
      "categories": [
        "All Wikipedia articles in need of updating",
        "All articles containing potentially dated statements",
        "All articles proposed for merging",
        "All articles with dead external links",
        "All articles with unsourced statements",
        "All articles with vague or ambiguous time",
        "All pages needing factual verification",
        "Articles containing potentially dated statements from 2013",
        "Articles proposed for merging from January 2026",
        "Articles with dead external links from October 2018",
        "Articles with permanently dead external links",
        "Articles with short description",
        "Articles with unsourced statements from April 2010",
        "Articles with unsourced statements from December 2024",
        "Articles with unsourced statements from February 2025",
        "Articles with unsourced statements from October 2013",
        "CS1: long volume value",
        "Developmental disabilities",
        "Intellectual disability",
        "Learning disabilities"
      ],
      "source_type": "wikipedia",
      "disability_categories": [
        "learning_disabilities",
        "emotional_behavioral",
        "intellectual"
      ],
      "fetched_at": "2026-02-02T13:31:01.325796"
    },
    {
      "id": "wiki_emotional_and_behavioral_disorders",
      "title": "Emotional and behavioral disorders",
      "url": "https://en.wikipedia.org/wiki/Emotional_and_behavioral_disorders",
      "content": "Emotional and behavioral disorders (EBD; also known as behavioral and emotional disorders) is a term used primarily in the United States that refers to a disability classification used in educational settings that allows educational institutions to provide special education and related services to students who have displayed poor social and/or academic progress.\nThe classification is often given to students after conducting a Functional Behavior Analysis. These students need individualized behavior supports such as a Behavior Intervention Plan, to receive a free and appropriate public education. Students with EBD may be eligible for an Individualized Education Plan (IEP) and/or accommodations in the classroom through a 504 Plan.\n\nHistory\n\nEarly history\nBefore any studies were done on the subject, mental illnesses were often thought to be a form of demonic possession or witchcraft. Since much was unknown, there was little to no distinction between the different types of mental illness and developmental disorders that we refer to today. Most often, they were dealt with by performing an exorcism on the person exhibiting signs of any mental illness. In the early to mid-1800s, asylums were introduced to America and Europe. There, patients were treated cruelly and often referred to as lunatics by doctors in the professional fields. The main focus of asylums were to shun people with mental illnesses from the public. In 1963, the Community Mental Health Centers Construction Act (Public Law 88–164), was passed by Congress and signed by John F. Kennedy, which provided federal funding to community mental health centers. This legislation changed the way that mental health services were handled and also led to the closure of many large asylums. Many laws soon followed assisting more and more people with EBDs. 1978 came with the passing of Public Law 94- 142 which required free and public education to all disabled children including those with EBDs. An extension of PL 94–142, PL 99-457, was put into act which would provide services to all disabled children from the ages of 3-5 by the 1990–91 school year. PL 94-142 has since been renamed to the Individuals with Disabilities Education Act (IDEA).\n\nUse and development of the term\nVarious terms have been used to describe irregular emotional and behavioral disorders. Many of the terms such as mental illness and psychopathology were used to describe adults with such conditions. Mental illness was a label for most people with any type of disorder and it was common for people with emotional and behavioral disorders to be labeled with a mental illness. However, those terms were avoided when describing children as it seemed too stigmatizing. In the late 1900s the term \"behaviorally disordered\" appeared. Some professionals in the field of special education accepted the term while others felt it ignored emotional issues. In order to make a more uniformed terminology, the National Mental Health and Special Education Coalition, which consists of over thirty professional and advocacy groups, coined the term \"emotional and behavioral disorders\" in 1988.\n\nCriteria\n\nAccording to the Individuals with Disabilities Education Act an EBD classification is required if one or more of the following characteristics is excessively observed in a student over a significant amount of time:\n\nLearning challenges that cannot be explained by intellectual, sensory, or health factors.\nTrouble keeping up or building satisfactory relationships with peers and teachers.\nInappropriate behavior (against self or others) or emotions (shares the need to harm others or self, low self-worth) in normal conditions.\nAn overall attitude of unhappiness or depression.\nA tendency to develop physical symptoms or fears related with individual or school issues.\nThe term \"EBD\" includes students diagnosed with schizophrenia. However, it does not have any significant bearing on students who are socially maladjusted unless they also meet the above criteria.\n\nCriticisms\nProviding or failing to provide an EBD classification to a student may be controversial, as the IDEA does not clarify which children would be considered \"socially maladjusted\". Students with a psychiatric diagnosis of conduct disorder are not guaranteed to receive additional educational services under an EBD classification. Students with an EBD classification who meet the diagnostic criteria for various disruptive behavior disorders, including attention-deficit hyperactivity disorder (ADHD), oppositional defiant disorder (ODD), or conduct disorder (CD) do not have an automatic eligibility to receive an IEP or 504 Plan. Students considered \"socially maladjusted\", but ineligible for an EBD classification (i.e., students diagnosed with conduct disorder), often receive better educational services in special education classrooms or alternative schools with high structure, clear rules, and consistent consequences.\n\nStudent characteristics\nStudents with EBD are a diverse population with a wide range of intellectual and academic abilities. Males, African-Americans, and economically disadvantaged students are over-represented in the EBD population, and students with EBD are more likely to live in single-parent homes, foster homes, or other non-traditional living situations. These students also tend to have low rates of positive social interactions with peers in educational contexts. Students with EBD are often categorized as \"internalizers\" (e.g., have poor self-esteem, or are diagnosed with an anxiety disorder or mood disorder) or \"externalizers\" (e.g., disrupt classroom instruction, or are diagnosed with disruptive behavior disorders such as oppositional defiant disorder and conduct disorder). Male students may be over-represented in the EBD population because they appear to be more likely to exhibit disruptive externalizing behavior that interferes with classroom instruction. Females may be more likely to exhibit internalizing behavior that does not interfere with classroom instruction, though to what extent this perception is due to social expectations of differences in male and female behavior is unclear. In any case, it is important to note that both internalizing and externalizing behaviour can and do occur in either sex; Students with EBD are also at an increased risk for learning disabilities, school dropout, substance abuse, and juvenile delinquency.\n\nInternalizing and externalizing behavior\nA person with EBD with \"internalizing\" behavior may have poor self-esteem, have depression, experience loss of interest in social, academic, and other life activities, and may exhibit non-suicidal self-injury or substance abuse. Students with internalizing behavior may also have a diagnosis of separation anxiety or another anxiety disorder, post-traumatic stress disorder (PTSD), specific or social phobia, obsessive–compulsive disorder (OCD), panic disorder, and/or an eating disorder. Teachers are more likely to write referrals for students that are overly disruptive. Screening tools used to detect students with high levels of \"internalizing\" behavior are not sensitive and are rarely used in practice. Students with EBD with \"externalizing\" behavior may be aggressive, non-compliant, extroverted, or disruptive.\nStudents with EBD that show externalizing behavior are often diagnosed with attention deficit hyperactivity disorder (ADHD), oppositional defiant disorder (ODD), conduct disorder, autism spectrum disorder and/or bipolar disorder; however, this population can also include typically developing children that have learned to exhibit externalizing behavior for various reasons (e.g., escape from academic demands or access to attention). These students often have difficulty inhibiting emotional responses resulting from anger, frustration, and disappointment. Students who \"externalize\" exhibit behaviors such as insulting, provoking, threatening, bullying, cursing, and fighting, along with other forms of aggression.",
      "summary": "Emotional and behavioral disorders (EBD; also known as behavioral and emotional disorders) is a term used primarily in the United States that refers to a disability classification used in educational settings that allows educational institutions to provide special education and related services to students who have displayed poor social and/or academic progress.\nThe classification is often given to students after conducting a Functional Behavior Analysis. These students need individualized behav...",
      "categories": [
        "Articles with short description",
        "Commons category link from Wikidata",
        "Disability by type",
        "Emotional issues",
        "Mental disorders diagnosed in childhood",
        "School and classroom behaviour",
        "Short description is different from Wikidata"
      ],
      "source_type": "wikipedia",
      "disability_categories": [
        "learning_disabilities",
        "emotional_behavioral"
      ],
      "fetched_at": "2026-02-02T13:31:02.827068"
    },
    {
      "id": "wiki_sensory_processing_disorder",
      "title": "Sensory processing disorder",
      "url": "https://en.wikipedia.org/wiki/Sensory_processing_disorder",
      "content": "Sensory processing disorder (SPD), formerly known as sensory integration dysfunction, is a condition in which multisensory input is not adequately processed in order to provide appropriate responses to the demands of the environment. Sensory processing disorder is present in many people with dyspraxia, autism spectrum disorder, Tourette's syndrome, and attention deficit hyperactivity disorder (ADHD). Individuals with SPD may inadequately process visual, auditory, olfactory (smell), gustatory (taste), tactile (touch), vestibular (balance), proprioception (body awareness), and interoception (internal body senses) sensory stimuli.\nSensory integration was defined by occupational therapist Anna Jean Ayres in 1972 as \"the neurological process that organizes sensation from one's own body and from the environment and makes it possible to use the body effectively within the environment\". Sensory processing disorder has been characterized as the source of significant problems in organizing sensation coming from the body and the environment and is manifested by difficulties in the performance in one or more of the main areas of life: productivity, leisure and play or activities of daily living.\nSources debate whether SPD is an independent disorder or represents the observed symptoms of various other, more well-established, disorders. SPD is not included in the Diagnostic and Statistical Manual of Mental Disorders of the American Psychiatric Association, and the American Academy of Pediatrics has recommended in 2012 that pediatricians not use SPD as a stand-alone diagnosis.\n\nSigns and symptoms\nSensory integration difficulties or sensory processing disorder (SPD) are characterized by persistent challenges with neurological processing of sensory stimuli that interfere with a person's ability to participate in everyday life. Such challenges can appear in one or several sensory systems of the somatosensory system, vestibular system, proprioceptive system, interoceptive system, auditory system, visual system, olfactory system, and gustatory system.\n\nWhile many people can present one or two symptoms, sensory processing disorder has to have a clear functional impact on the person's life.\nSigns of over-responsivity, including, for example, dislike of textures such as those found in fabrics, foods, grooming products or other materials found in daily living, to which most people would not react, and serious discomfort, sickness or threat induced by normal sounds, lights, ambient temperature, movements, smells, tastes, or even inner sensations such as heartbeat.\nSigns of under-responsivity, including sluggishness and lack of responsiveness.\nSensory cravings, including, for example, fidgeting, impulsiveness, or seeking or making loud, disturbing noises; and sensorimotor-based problems, including slow and uncoordinated movements or poor handwriting.\nSensory discrimination problems, which might manifest themselves in behaviors such as things constantly dropped.\nSymptoms may vary according to the disorder's type and subtype present.\n\nRelationship to other disorders\nSensory integration and processing difficulties can be a feature of a number of disorders, including anxiety problems, attention deficit hyperactivity disorder (ADHD), food intolerances, behavioral disorders, and particularly, autism spectrum disorder (ASD). This pattern of comorbidities poses a significant challenge to those who claim that SPD is an identifiably specific disorder, rather than simply a term given to a set of symptoms common to other disorders.\nTwo studies have provided preliminary evidence suggesting that there may be measurable neurological differences between children diagnosed with SPD and control children classified as neurotypical or children diagnosed with autism. Despite this evidence, that SPD researchers have yet to agree on a proven, standardized diagnostic tool undermines researchers' ability to define the boundaries of the disorder and makes correlational studies, like those on structural brain abnormalities, less convincing.\n\nCauses\nThe exact cause of SPD is not known. However, it is known that the midbrain and brainstem regions of the central nervous system are early centers in the processing pathway for multisensory integration; these brain regions are involved in processes including coordination, attention, arousal, and autonomic function. After sensory information passes through these centers, it is then routed to brain regions responsible for emotions, memory, and higher level cognitive functions.\n\nMechanism\nResearch in sensory processing in 2007 is focused on finding the genetic and neurological causes of SPD. Electroencephalography (EEG), measuring event-related potential (ERP), and magnetoencephalography (MEG) are traditionally used to explore the causes behind the behaviors observed in SPD.\nDifferences in tactile and auditory over-responsivity show moderate genetic influences, with tactile over-responsivity demonstrating greater heritability. Differences in auditory latency (the time between the input is received and when reaction is observed in the brain), hypersensitivity to vibration in the Pacinian corpuscles receptor pathways, and other alterations in unimodal and multisensory processing have been detected in autism populations.\nPeople with sensory processing deficits appear to have less sensory gating than typical subjects, and atypical neural integration of sensory input. In people with sensory over-responsivity, different neural generators activate, causing the automatic association of causally related sensory inputs that occurs at this early sensory-perceptual stage to not function properly. People with sensory over-responsivity might have increased D2 receptor in the striatum, related to aversion to tactile stimuli, and reduced habituation. In animal models, prenatal stress significantly increased tactile avoidance.\nRecent research has also found an abnormal white matter microstructure in children with SPD, compared with typical children and those with other developmental disorders such as autism and ADHD.\nOne hypothesis is that multisensory stimulation may activate a higher-level system in the frontal cortex that involves attention and cognitive processing, rather than the automatic integration of multisensory stimuli observed in typically developing adults in the auditory cortex.\n\nDiagnosis\nSensory processing disorder is accepted in the Diagnostic Classification of Mental Health and Developmental Disorders of Infancy and Early Childhood (DC:0-3R). It is not recognized as a mental disorder in medical manuals such as the ICD-10 or the DSM-5.\nThere is not a single test to diagnose sensory processing disorder. Diagnosis is primarily arrived at by the use of standardized tests, standardized questionnaires, expert observational scales, and free-play observation at an occupational therapy gym. Observation of functional activities might be carried at school and home as well.\nThough diagnosis in most of the world is done by an occupational therapist, in some countries diagnosis is made by certified professionals, such as psychologists, learning specialists, physiotherapists and/or speech and language therapists. Some countries recommend to have a full psychological and neurological evaluation if symptoms are too severe.",
      "summary": "Sensory processing disorder (SPD), formerly known as sensory integration dysfunction, is a condition in which multisensory input is not adequately processed in order to provide appropriate responses to the demands of the environment. Sensory processing disorder is present in many people with dyspraxia, autism spectrum disorder, Tourette's syndrome, and attention deficit hyperactivity disorder (ADHD). Individuals with SPD may inadequately process visual, auditory, olfactory (smell), gustatory (ta...",
      "categories": [
        "All articles with dead external links",
        "All articles with unsourced statements",
        "Alternative diagnoses",
        "Articles with dead external links from March 2018",
        "Articles with permanently dead external links",
        "Articles with short description",
        "Articles with unsourced statements from August 2022",
        "Articles with unsourced statements from December 2020",
        "Attention deficit hyperactivity disorder",
        "Autism",
        "CS1: unfit URL",
        "Neurological disorders",
        "Occupational therapy",
        "Pages displaying short descriptions of redirect targets via Module:Annotated link",
        "Pages using div col with small parameter",
        "Perception",
        "Sensory systems",
        "Short description is different from Wikidata"
      ],
      "source_type": "wikipedia",
      "disability_categories": [
        "autism",
        "adhd",
        "sensory_processing"
      ],
      "fetched_at": "2026-02-02T13:31:04.284574"
    },
    {
      "id": "wiki_executive_dysfunction",
      "title": "Executive dysfunction",
      "url": "https://en.wikipedia.org/wiki/Executive_dysfunction",
      "content": "In psychology and neuroscience, executive dysfunction, or executive function deficit, is a disruption to the efficacy of the executive functions, which is a group of cognitive processes that regulate, control, and manage other cognitive processes. Executive dysfunction can refer to both neurocognitive deficits and behavioural symptoms. It is implicated in numerous neurological and mental disorders, as well as short-term and long-term changes in non-clinical executive control. It can encompass other cognitive difficulties like planning, organizing, initiating tasks, and regulating emotions. It is a core characteristic of attention deficit hyperactivity disorder (ADHD) and can elucidate numerous other recognized symptoms. Extreme executive dysfunction is the cardinal feature of dysexecutive syndrome.\n\nOverview\nExecutive functioning is a theoretical construct representing a domain of cognitive processes that regulate, control, and manage other cognitive processes. Executive functioning is not a unitary concept; it is a broad description of the set of processes involved in certain areas of cognitive and behavioural control. Executive processes are integral to higher brain function, particularly in the areas of goal formation, planning, goal-directed action, self-monitoring, attention, response inhibition, and coordination of complex cognition and motor control for effective performance. Deficits of the executive functions are observed in all populations to varying degrees, but severe executive dysfunction can have devastating effects on cognition and behaviour in both individual and social contexts on a day-to-day basis.\nExecutive dysfunction does occur to a minor degree in all individuals on both short-term and long-term scales. In non-clinical populations, the activation of executive processes appears to inhibit further activation of the same processes, suggesting a mechanism for normal fluctuations in executive control. Decline in executive functioning is also associated with both normal and clinical aging. The decline of memory processes as people age appears to affect executive functions, which also points to the general role of memory in executive functioning.\nExecutive dysfunction appears to consistently involve disruptions in task-oriented behavior, which requires executive control in the inhibition of habitual responses and goal activation. Such executive control is responsible for adjusting behaviour to reconcile environmental changes with goals for effective behaviour. Impairments in set shifting ability are a notable feature of executive dysfunction; set shifting is the cognitive ability to dynamically change focus between points of fixation based on changing goals and environmental stimuli. This offers a parsimonious explanation for the common occurrence of impulsive, hyperactive, disorganized, and aggressive behaviour in clinical patients with executive dysfunction. A 2011 study confirms there is a lack of self-control, greater impulsivity, and greater disorganization with executive dysfunction, leading to greater amounts of aggressive behavior.\nExecutive dysfunction, particularly in working memory capacity, may also lead to varying degrees of emotional dysregulation, which can manifest as chronic depression, anxiety, or hyperemotionality. Russell Barkley proposed a hybrid model of the role of behavioural disinhibition in the presentation of ADHD, which has served as the basis for much research of both ADHD and broader implications of the executive system.\nOther common and distinctive symptoms of executive dysfunction include utilization behaviour, which is compulsive manipulation/use of nearby objects due simply to their presence and accessibility (rather than a functional reason); and imitation behaviour, a tendency to rely on imitation as a primary means of social interaction. Research also suggests that executive set shifting is a co-mediator with episodic memory of feeling-of-knowing (FOK) accuracy, such that executive dysfunction may reduce FOK accuracy.\nThere is some evidence suggesting that executive dysfunction may produce beneficial effects as well as maladaptive ones. Abraham et al. demonstrate that creative thinking in schizophrenia is mediated by executive dysfunction, and they establish a firm etiology for creativity in psychoticism, pinpointing a cognitive preference for broader top-down associative thinking versus goal-oriented thinking, which closely resembles aspects of ADHD. It is postulated that elements of psychosis are present in both ADHD and schizophrenia/schizotypy due to dopamine overlap.\n\nCause\nThe cause of executive dysfunction is heterogeneous, as many neurocognitive processes are involved in the executive system and each may be compromised by a range of genetic and environmental factors. Learning and development of long-term memory play a role in the severity of executive dysfunction through dynamic interaction with neurological characteristics. Studies in cognitive neuroscience suggest that executive functions are widely distributed throughout the brain, though a few areas have been isolated as primary contributors. Executive dysfunction is studied extensively in clinical neuropsychology as well, allowing correlations to be drawn between such dysexecutive symptoms and their neurological correlates. A 2015 study confirmed that executive dysfunction has a positive correlation with neurodevelopmental disorders such as autism spectrum disorder (ASD) or attention deficit hyperactivity disorder (ADHD).\nExecutive processes are closely integrated with memory retrieval capabilities for overall cognitive control; in particular, goal/task-information is stored in both short-term and long-term memory, and effective performance requires effective storage and retrieval of this information.\nExecutive dysfunction characterizes many of the symptoms observed in numerous clinical populations. In the case of acquired brain injury and neurodegenerative diseases there is a clear neurological etiology producing dysexecutive symptoms. Conversely, syndromes and disorders are defined and diagnosed based on their symptomatology rather than etiology. Thus, while Parkinson's disease, a neurodegenerative condition, causes executive dysfunction, a disorder such as ADHD is a classification given to a set of subjectively-determined symptoms implicating executive dysfunction – models from the 1990s and 2000s indicate that such clinical symptoms are caused by executive dysfunction.\n\nNeurophysiology\nExecutive functioning is not a unitary concept. Many studies have been conducted in an attempt to pinpoint the exact regions of the brain that lead to executive dysfunction, producing a vast amount of often conflicting information indicating wide and inconsistent distribution of such functions. A common assumption is that disrupted executive control processes are associated with pathology in prefrontal brain regions. This is supported to some extent by the primary literature, which shows both pre-frontal activation and communication between the pre-frontal cortex and other areas associated with executive functions such as the basal ganglia and cerebellum.\nIn most cases of executive dysfunction, deficits are attributed to either frontal lobe damage or dysfunction, or to disruption in fronto-subcortical connectivity. Neuroimaging with PET and fMRI has confirmed the relationship between executive function and functional frontal pathology. Neuroimaging studies have also suggested that some constituent functions are not discretely localized in prefrontal regions. Functional imaging studies using different tests of executive function have implicated the dorsolateral prefrontal cortex to be the primary site of cortical activation during these tasks.",
      "summary": "In psychology and neuroscience, executive dysfunction, or executive function deficit, is a disruption to the efficacy of the executive functions, which is a group of cognitive processes that regulate, control, and manage other cognitive processes. Executive dysfunction can refer to both neurocognitive deficits and behavioural symptoms. It is implicated in numerous neurological and mental disorders, as well as short-term and long-term changes in non-clinical executive control. It can encompass ot...",
      "categories": [
        "All articles with unsourced statements",
        "All pages needing factual verification",
        "Articles with short description",
        "Articles with unsourced statements from January 2025",
        "CS1 errors: missing periodical",
        "Cognitive science",
        "Motor control",
        "Neuropsychological assessment",
        "Neuropsychology",
        "Self",
        "Short description is different from Wikidata",
        "Use dmy dates from March 2022",
        "Wikipedia articles needing factual verification from March 2020",
        "Wikipedia articles needing page number citations from March 2020"
      ],
      "source_type": "wikipedia",
      "disability_categories": [
        "adhd"
      ],
      "fetched_at": "2026-02-02T13:31:05.970893"
    },
    {
      "id": "wiki_applied_behavior_analysis",
      "title": "Applied behavior analysis",
      "url": "https://en.wikipedia.org/wiki/Applied_behavior_analysis",
      "content": "Applied behavior analysis (ABA), also referred to as behavioral engineering, is a psychological discipline that uses respondent and operant conditioning to change human and animal behavior. ABA is the applied form of behavior analysis; the other two are: radical behaviorism (or the philosophy of the science) and experimental analysis of behavior, which focuses on basic experimental research.\nThe term applied behavior analysis has replaced behavior modification because the latter approach suggested changing behavior without clarifying the relevant behavior-environment interactions. In contrast, ABA changes behavior by first assessing the functional relationship between a targeted behavior and the environment, a process known as a functional behavior assessment. Further, the approach seeks to develop socially acceptable alternatives for maladaptive behaviors, often through implementing differential reinforcement contingencies.\nAlthough ABA is most commonly associated with autism intervention, it has been used in a range of other areas, including applied animal behavior, substance abuse, organizational behavior management, behavior management in classrooms, and acceptance and commitment therapy.\nABA is controversial and rejected by the autistic rights movement due to a perception that it emphasizes normalization instead of acceptance, and a history of, in some forms of ABA and its predecessors, the use of aversives, such as electric shocks.\n\nDefinition\nABA is an applied science devoted to developing procedures that will produce meaningful changes in behavior. \nIt is to be distinguished from the experimental analysis of behavior, which focuses on basic research, but it uses principles developed by such research, in particular operant conditioning and classical conditioning. Both branches of behavior analysis adopt the viewpoint of radical behaviorism, treating thoughts, emotions, and other covert activity as behavior that is subject to the same responses as overt behavior. This represents a shift away from methodological behaviorism, which restricts behavior-change procedures to behaviors that are overt, and was the conceptual underpinning of behavior modification.\nBehavior analysts emphasize that the science of behavior must be a natural science as opposed to a social science. As such, behavior analysts focus on the observable relationship of behavior with the environment, including antecedents and consequences, without resort to \"hypothetical constructs\".\n\nHistory\nThe field of behaviorism originated in 1913 by John B. Watson with his seminal work \"Psychology as the Behaviorist Views it.\" In the article, Watson argued against the field of psychology's focus on consciousness and proposed that the field instead focus on observable behaviors, a concept referred to as methodological behaviorism.\nIn the 1930s, B. F. Skinner established the concept of radical behaviorism which extended Watson's theory to encompass private events that are unobservable to others, such as thoughts and emotions.\nThe initial experiments studying the effectiveness of behavior analysis on human subjects were published in the 1940s and '50s, including Paul Fuller's \"Operant conditioning of a vegetative human organism\" (1949).\nIn 1957, the Society for Experimental Analysis of Behavior (SEAB) was founded by a group of behavioral psychologists, including Skinner and Charles Ferster, to publish a journal that focused on operant conditioning, and the following year, the first edition of the Journal of the Experimental Analysis of Behavior was published.\nTeodoro Ayllon and Jack Michael's study \"The psychiatric nurse as a behavioral engineer\" in 1959 was the first to employ the seven dimensions of ABA, which demonstrated how effective a token economy was in altering the aberrant behavior of hospitalized patients with schizophrenia and intellectual disability. The successful results from this study led researchers at the University of Kansas to start the Journal of Applied Behavior Analysis (JABA) in 1968.\nA group of researchers at the University of Washington, including Donald Baer, Sidney W. Bijou, Bill Hopkins, Jay Birnbrauer, Todd Risley, and Montrose Wolf, applied the principles of behavior analysis to treat autism, manage the behavior of children and adolescents in juvenile detention centers, and organize employees who required proper structure and management in businesses. In 1968, Baer, Bijou, Risley, Birnbrauer, Wolf, and James Sherman joined the Department of Human Development and Family Life at the University of Kansas, where they founded the Journal of Applied Behavior Analysis.\nFrom 1960 through 1997, Ivar Lovaas researched the efficacy of ABA techniques on autistic children. While Lovaas is often considered a pioneer in the field of ABA and his work was instrumental in establishing it as an effective treatment for autism, his early use of aversives (including slapping and electric shocks) has raised considerable ethical concerns. In 2022, a major ABA trade group, the Association for Behavior Analysis International (ABAI), issued a policy statement unconditionally condemning electric-shock aversives. However, the following year, the task force ABAI formed to assess the use of electric-shock aversives authored a paper in which they claimed such methods were not inherently unethical and that patients and caregivers should be permitted to opt into them to treat \"severe, life-threatening behavior.\" ABAI has historically been criticized by members of the autistic community, including by the Autistic Self Advocacy Network (ASAN) and its leadership, for routinely platforming staff from the Judge Rotenberg Center (JRC) at its annual conferences. The JRC is the only known facility in the United States whose ABA practitioners still use electric shocks to punish autistic people in their care, a practice labeled torture by the United Nations special rapporteur on torture. After ABAI released its 2022 policy statement, ASAN called on ABAI to stop platforming JRC staff members and lobby for a federal ban on electric-shock aversives. \nDuring the 1960s and 70s, researchers began experimenting on the use of ABA techniques in the form of gay conversion therapy. These methodologies often involved the use of punishment procedures. Lovaas and his doctoral student George Rekers co-authored a paper titled \"Behavioral treatment of deviant sex-role behaviors in a male child\" in 1974. Several of Lovaas's contemporaries released criticisms of the paper shortly after its publication, and conversion therapy was formally condemned by ABAI in 2021. In 2020, JABA added an expression of concern and an editor's note to the 1974 paper, which it had originally published. The documents acknowledged the harm done by the study to its 4-year-old subject and the LGBTQ+ community at large, while also claiming the study did not violate the ethical standards of its time and could not be causally linked to the subject's suicide as an adult. Some members of academia, including Arthur Kaplan (of the New York University Grossman School of Medicine) and Austin Johnson (of the University of California, Riverside's Graduate School of Education), criticized the journal for claiming the study was conducted ethically for its time and refusing to retract the paper outright.\nOver the years, \"behavior analysis\" gradually superseded \"behavior modification.\" Instead of simply attempting to alter maladaptive behavior, behavior analysts sought to understand the function of that behavior, what reinforcement histories (i.e., attention seeking, escape, automatic (sensory stimulation), access to preferred items or activities) promote and maintain it, and how it can be replaced by an alternative, more appropriate behavior.\n\nCharacteristics\n\nBaer, Wolf, and Risley's 1968 article is still used as the standard description of ABA. It lists the following seven characteristics of ABA.",
      "summary": "Applied behavior analysis (ABA), also referred to as behavioral engineering, is a psychological discipline that uses respondent and operant conditioning to change human and animal behavior. ABA is the applied form of behavior analysis; the other two are: radical behaviorism (or the philosophy of the science) and experimental analysis of behavior, which focuses on basic experimental research.\nThe term applied behavior analysis has replaced behavior modification because the latter approach suggest...",
      "categories": [
        "All articles lacking reliable references",
        "All articles with criticism or controversy sections",
        "Applied psychology",
        "Articles intentionally citing publications with expressions of concern",
        "Articles lacking reliable references from January 2026",
        "Articles needing more viewpoints from July 2024",
        "Articles with criticism or controversy sections from July 2025",
        "Articles with excerpts",
        "Articles with short description",
        "Behavior",
        "Behavior modification",
        "Behavioral concepts",
        "Behaviorism",
        "CS1 maint: multiple names: authors list",
        "Industrial and organizational psychology",
        "Life coaching",
        "Personal development",
        "Short description is different from Wikidata",
        "Treatment of autism",
        "Use dmy dates from January 2016"
      ],
      "source_type": "wikipedia",
      "disability_categories": [
        "autism",
        "emotional_behavioral"
      ],
      "fetched_at": "2026-02-02T13:31:07.390658"
    },
    {
      "id": "wiki_positive_behavior_support",
      "title": "Positive behavior support",
      "url": "https://en.wikipedia.org/wiki/Positive_behavior_support",
      "content": "Positive behavior support (PBS) uses tools from applied behaviour analysis and values of normalisation and social role valorisation theory to improve quality of life, in schools and individuals with learning/intellectual disabilities. PBS uses functional analysis to understand what maintains an individual's challenging behavior and how to support the individual to get these needs met in more appropriate way, instead of using 'challenging behaviours'. People's inappropriate behaviors are difficult to change because they are functional; they serve a purpose for them (sensory needs, attachment/attention, escape or tangible). These behaviors may be supported by reinforcement in the environment. \nPositive Reinforcement\nAdding something pleasant to increase a behavior.\nHow it works: After a desired behavior, you give a reward (something the person wants).\nGoal: The pleasant consequence motivates the person to repeat the behavior.\nNegative Reinforcement\nRemoving something unpleasant to increase a behavior.\nHow it works: After the desired behavior, something unpleasant stops or is taken away.\nGoal: The relief encourages the behavior to happen again.\n\nExamples:\nTaking painkillers removes a headache\nNegative reinforcement is not punishment. It strengthens behavior by taking away discomfort; punishment reduces behavior.\nThe positive behavior support process involves identifying goals, then undertaking functional behavior assessment (FBA). FBAs clearly describe behaviors, identify the contexts (events, times, and situation) that predict when behavior will and will not occur, and consequences that maintain the behavior. The FBA includes a hypothesis about the behavior and data for a baseline. This informs the support plan design, implementation and monitoring of the plan.\nPositive behavior support is increasingly being recognized as a strategy that is feasible, desirable, and effective. For example, teachers and parents need strategies they are able and willing to use and that affect the child's ability to participate in community and school activities. \nBy changing stimulus and reinforcement in the environment and teaching the person to strengthen deficit skill areas, their behavior changes. In schools, this can allow students to be included in the general education setting. \nThree areas of deficit skills addressed by PBS are communication skills, social skills, and self-management skills. Re-directive therapy as positive behavior support is especially effective in the parent–child relationship. Where other treatment plans have failed, re-directive therapy allows for a positive interaction between parents and children. Positive behavior support is successful in the school setting because it is primarily a teaching method.\n\nIn U.S. schools\nSchools are required to conduct functional behavioral assessment (FBA) and use positive behavior support with students who are identified as disabled and are at risk for expulsion, alternative school placement, or more than 10 days of suspension. Even though FBA is required under limited circumstances it is good professional practice to use a problem-solving approach to managing problem behaviors in the school setting.\nThe use of positive behavior interventions and supports (PBIS) in schools is widespread in part because it is a professional skill in early special education programs (as opposed to Rogerian counseling). The program offers a primary, secondary, and tertiary level of intervention. A basic tenet of the PBIS approach includes identifying students in one of three categories – primary, secondary, or tertiary Interventions are specifically developed for each of these levels with the goal of reducing the risk for academic or social failure. The interventions become more focused and complex at each level.\nPrimary prevention strategies focus on interventions used on a school-wide basis for all students. PBS use for other than a designated population group has neither been approved by the professions or the public-at-large. This level of prevention is considered \"primary\" because all students are exposed in the same way, and at the same level, to the intervention. Approximately 80–85% of students who are not at risk for behavior problems respond in a positive manner to this prevention level. Primary prevention strategies include, but are not limited to, using effective teaching practices and curricula, explicitly teaching behavior that is acceptable within the school environment, focusing on ecological arrangement and systems within the school, consistent use of precorrection procedures, using active supervision of common areas, and creating reinforcement systems that are used on a school-wide basis.\nSecondary prevention strategies involve around 10–15% of the school population who do not respond to the primary prevention strategies and are at risk for academic failure or behavior problems but are not in need of individual support. Interventions at the secondary level often are delivered in small groups to maximize time and effort and should be developed with the unique needs of the students within the group. Examples of these interventions include social support such as social skills training (e.g., explicit instruction in skill-deficit areas, friendship clubs, check in/check out, role playing) or academic support. Additionally, secondary programs could include behavioral support approaches (e.g., simple Functional Behavioral Assessments [FBA], precorrection, self-management training). \nEven with the heightened support within secondary level interventions, some students (1–7%) will need the additional assistance at the tertiary level.Tertiary prevention programs focus on students who display persistent patterns of disciplinary problems. Tertiary-level programs are also called intensive or individualized interventions and are the most comprehensive and complex. The interventions within this level are strength-based in that the complexity and intensity of the intervention plans directly reflect the complexity and intensity of the behaviors. Students within the tertiary level continue involvement in primary and secondary intervention programs and receive additional support as well. These supports could include use of full FBA, de-escalation training for the student, heightened use of natural supports (e.g., family members, friends of the student), and development of a Behavior Intervention Plan (BIP).\nAlthough comprehensive services are important for all students, a critical aspect of the three-tiered model is the identification of students at one of the three levels. One method of identifying students in need of interventions is to analyze office disciplinary referrals (ODR) taken at the school. ODRs may be a means of both identifying students' risk level for antisocial behavior and school failure. Researchers have advocated analyzing this naturally occurring data source as a relatively cheap, effective, and ongoing measurement device for PBS programs.\nODRs have also been shown to be effective in determining where students fall within a three-leveled model, developing professional development as well as helping coordinate school efforts with other community agencies, predicting school failure in older grades as well as delinquency, indicating types of behavior resulting in referrals, and determination of the effectiveness of precorrection techniques. Analyzing discipline referral data can also help school personnel identify where to improve ecological arrangements within a school and to recognize how to increase active supervision in common areas. A limitation of only using ODRs to measure behavior problems is that they have been found to be ineffective at measuring internalizing behavior problems such as anxiety, depression, and withdrawal.",
      "summary": "Positive behavior support (PBS) uses tools from applied behaviour analysis and values of normalisation and social role valorisation theory to improve quality of life, in schools and individuals with learning/intellectual disabilities. PBS uses functional analysis to understand what maintains an individual's challenging behavior and how to support the individual to get these needs met in more appropriate way, instead of using 'challenging behaviours'. People's inappropriate behaviors are difficul...",
      "categories": [
        "All Wikipedia articles written in American English",
        "All articles with a promotional tone",
        "All articles with incomplete citations",
        "Articles with a promotional tone from November 2024",
        "Articles with incomplete citations from July 2011",
        "Articles with incomplete citations from November 2020",
        "Articles with short description",
        "Behavior modification",
        "Behaviorism",
        "Industrial and organizational psychology",
        "Life coaching",
        "Personal development",
        "Short description is different from Wikidata",
        "Use American English from October 2020",
        "Use mdy dates from October 2020"
      ],
      "source_type": "wikipedia",
      "disability_categories": [
        "adhd",
        "sensory_processing",
        "intellectual",
        "emotional_behavioral"
      ],
      "fetched_at": "2026-02-02T13:31:08.867991"
    },
    {
      "id": "wiki_behavior_modification",
      "title": "Behavior modification",
      "url": "https://en.wikipedia.org/wiki/Behavior_modification",
      "content": "Behavior modification is a treatment approach that uses respondent and operant conditioning to change behavior. Based on methodological behaviorism, overt behavior is modified with (antecedent) stimulus control and consequences, including positive and negative reinforcement contingencies to increase desirable behavior, as well as positive and negative punishment, and extinction to reduce problematic behavior.\nContemporary applications of behavior modification include applied behavior analysis (ABA), behavior therapy, exposure therapy, and cognitive-behavioral therapy. Since the inception of behavior modification, significant and substantial advancements have been made to focus on the function of behavior, choice, cultural sensitivity, compassion, equity, and quality of life (QoL). Paradigm shifts have been made since the inception of behavior modification, and these changes are focused on the dignity of the individual receiving treatment, and found in today's graduate training programs.\n\nDescription and history\nThe first use of the term behavior modification appears to have been by Edward Thorndike in 1911. His article Provisional Laws of Acquired Behavior or Learning makes frequent use of the term \"modifying behavior\". Through early research in the 1940s and the 1950s the term was used by Joseph Wolpe's research group. The experimental tradition in clinical psychology used it to refer to psycho-therapeutic techniques derived from empirical research. In the 1960s, behavior modification operated on stimulus-response-reinforcement framework (S-R-SR), emphasizing the concept of 'transactional' explanations of behavior. It has since come to refer mainly to techniques for increasing adaptive behavior through reinforcement and decreasing maladaptive behavior through extinction or punishment (with emphasis on the former). Furthermore, B. F. Skinner proposed the concept of reinforcement and punishment through his behaviorism theory, which suggested that humans are susceptible to changes based under reinforcement or punishment-based stimuli that can alter their behaviors. The evaluations of each of these analysts helped to shape the foundation of behavioral modification and how it can utilized to alter certain behaviors.\nIn recent years, the concept of punishment has had many critics, though these criticisms tend not to apply to negative punishment (time-outs) and usually apply to the addition of some aversive event. The use of positive punishment by board certified behavior analysts is restricted to extreme circumstances when all other forms of treatment have failed and when the behavior to be modified is a danger to the person or to others (see professional practice of behavior analysis). In clinical settings positive punishment is usually restricted to using a spray bottle filled with water as an aversive event. When misused, more aversive punishment can lead to affective (emotional) disorders, as well as to the receiver of the punishment increasingly trying to avoid the punishment (i.e., \"not get caught\").\nBehavior modification can also be applied to areas of study in habitual formation and in the classroom. According to a study done in 2021, behavioral modification techniques were tested with individuals with habits and saw positive change. While there is still much research to be done on understanding different techniques of behavioral modification and how it can be implemented, it can be used in classrooms as well in a form of teaching. In an educational setting, behavioral modification such as reinforcement or punishment are often provided automatically or manually by secondary school teachers and can have varying outcomes. The further implementation of behavioral modification techniques in the classroom and their effectiveness could imply more positive outcomes for students in the future if more research is completed. \nBehavior modification relies on the following:\n\nReinforcement (positive and negative)\nPunishment (positive and negative)\nExtinction\nShaping\nFading\nChaining\nThe usage of techniques such as reinforcement, punishment, and extinction point to a similarity between operant conditioning and behavioral modification. Operant conditioning relies on the effects of rewards and punishment, and this can be intertwined within the confines of behavioral modification in regards to treating children in school settings.\n\nAreas of effectiveness\nFunctional behavior assessment forms the core of applied behavior analysis, and this technology was not part of behavior modification. A Functional Behavioral Assessment (FBA) is a systematic process used to identify the underlying causes and functions of challenging behaviors. Unlike traditional behavior modification, which often focused solely on altering the behavior itself, FBA seeks to understand the reasons behind a behavior by examining the environmental, social, and psychological factors that contribute to it. The FBA process involves several steps: defining the problematic behavior in observable and measurable terms, collecting data through direct observation, interviews, and review of records, identifying patterns and triggers, hypothesizing the function of the behavior, and developing intervention strategies based on these hypotheses.\nThe importance of FBA lies in its comprehensive and individualized approach. By understanding the function of a behavior, interventions can be tailored to address the root cause rather than just the symptoms. This leads to more effective and lasting behavior change. For example, if a behavior is identified as a way for an individual to escape a difficult task, the intervention might include teaching more appropriate ways to request a break or modifying the task to make it more manageable. In contrast, traditional behavior modification might only attempt to suppress the escape behavior without addressing the underlying issue, which could lead to frustration and the emergence of other problematic behaviors.\nAdditionally, FBA emphasizes a positive and proactive approach, focusing on teaching alternative, contextually appropriate behaviors and modifying the environment to support these behaviors design to support QoL. This stands in contrast to the often punitive nature of previous behavior modification techniques. Overall, FBA represents a more humane and effective method for understanding and addressing challenging behaviors, leading to improved outcomes for individuals.\n\nPeople with autism spectrum disorder\nProfessionals use this science of behavior modification often with individuals with autism spectrum disorder (ASD). The purpose of behavior modification for these people is to work on increasing socially significant behavior such as academic skills, adaptive skills, social skills, and vocational skills, while decreasing problem behaviors. One of the main issues behavior modification addresses is deficits in communication skills that cause problem behaviors such as crying, screaming, falling, and hitting in those with autism.\nOne of the main forms of behavior modification used with people who have ASD is applied behavior analysis (ABA). Applied behavior analysis is a form of behavior modification that has a specific framework and ethical rules, and it has gained popularity in the field of psychology over the past 50 years. Applied behavior analysis can be seen an intervention that allows people with autism to gain bodily autonomy and choice making in their life, all while learning adaptive skills to become independent.One way the usage of behavior modification can teach individuals to discriminate between preferred and non preferred items and further be generalized to other areas of their life to give them control.\nWhile behavior modification is more commonly known to be used with those with ASD, behavior modification teachings can also improve interactions between neurotypical people and people with autism.",
      "summary": "Behavior modification is a treatment approach that uses respondent and operant conditioning to change behavior. Based on methodological behaviorism, overt behavior is modified with (antecedent) stimulus control and consequences, including positive and negative reinforcement contingencies to increase desirable behavior, as well as positive and negative punishment, and extinction to reduce problematic behavior.\nContemporary applications of behavior modification include applied behavior analysis (A...",
      "categories": [
        "Articles with short description",
        "Behavior",
        "Behavior modification",
        "Behaviorism",
        "Commons category link from Wikidata",
        "Mind control",
        "Pages with missing ISBNs",
        "Short description is different from Wikidata"
      ],
      "source_type": "wikipedia",
      "disability_categories": [
        "emotional_behavioral"
      ],
      "fetched_at": "2026-02-02T13:31:10.960835"
    },
    {
      "id": "wiki_assistive_technology",
      "title": "Assistive technology",
      "url": "https://en.wikipedia.org/wiki/Assistive_technology",
      "content": "Assistive technology (AT) is a term for assistive, adaptive, and rehabilitative devices for people with disabilities and the elderly. People with disabilities often have difficulty performing activities of daily living (ADLs) independently, or even with assistance. ADLs are self-care activities that include toileting, mobility (ambulation), eating, bathing, dressing, grooming, and personal device care. Assistive technology can ameliorate the effects of disabilities that limit the ability to perform ADLs. Assistive technology promotes greater independence by enabling people to perform tasks they were formerly unable to accomplish, or had great difficulty accomplishing, by providing enhancements to, or changing methods of interacting with, the technology needed to accomplish such tasks. For example, wheelchairs provide independent mobility for those who cannot walk, while assistive eating devices can enable people who cannot feed themselves to do so. Due to assistive technology, people with disabilities have an opportunity of a more positive and easygoing lifestyle, with an increase in \"social participation\", \"security and control\", and a greater chance to \"reduce institutional costs without significantly increasing household expenses.\" In schools, assistive technology can be critical in allowing students with disabilities to access the general education curriculum. Students who experience challenges writing or keyboarding, for example, can use voice recognition software instead. Assistive technologies assist people who are recovering from strokes and people who have sustained injuries that affect their daily tasks.\nA recent study from India led by Dr Edmond Fernandes et al. from Edward & Cynthia Institute of Public Health which was published in WHO SEARO Journal informed that geriatric care policies which address functional difficulties among older people will ought to be mainstreamed, resolve out-of-pocket spending for assistive technologies will need to look at government schemes for social protection.\n\nAdaptive technology\nAdaptive technology and assistive technology are different. Assistive technology is something that is used to help people with disabilities, while adaptive technology covers items that are specifically designed for disabled people and would seldom be used by a non-disabled person. In other words, assistive technology is any object or system that helps people with disabilities, while adaptive technology is specifically designed for disabled people. Consequently, adaptive technology is a subset of assistive technology. Adaptive technology often refers specifically to electronic and information technology access.\n\nOccupational therapy and assistive technology\nOccupational Therapy (OT) utilizes everyday occupations as a therapeutic tool for enhancing or enabling participation in healthy occupations to promote health and well-being (AOTA, 2020). Occupations include activities of daily living (ADLs), instrumental activities of daily living (IADLs), health management, rest and sleep, education, work, play, leisure, and social participation (AOTA, 2020). \"As occupational therapy professionals, we are uniquely trained to advocate for client-centered care that reduces barriers to participation in meaningful occupations and promotes overall well-being\" (Clark, Iqbal & Myers, 2022)\nOT practitioners (OTP) utilize assistive technologies (AT) to modify environments and promote access and fit to facilitate independence. For example, voice activated smart home technology allows an individual to control devices such as light switches, thermostat, oven, blinds, and music from their location. OTP evaluate client's strengths and abilities and connects with desired tasks. OTP help empower the client to match specific goals to AT tools. The theoretical approaches or frameworks OTPs frequently use to guide a client's AT choices may include: 1) The HAAT model by Cook, Polgar & Encarnaçāo (2015) 2) The interdependence - Human Activity Assistive Technology Model (I-HAAT) by Lee, et al. (2020); 3) The SETT Framework by Zabala (2005); or 4) The Unified Theory of Acceptance and Use of Technology (UTAUT 2) by Venkatesh, Thong & Xu (2012). Also, OTPs may seek advanced training through the Rehabilitation Engineering and Assistive Technology Society of North America (RESNA) organization to receive their Assistive Technology Professional (ATP) Certification and/or Seating and Mobility Specialist (SMS) Certification. Additional trainings and certifications may specialize in a focus area such as the Certified Assistive Technology Instructional Specialist for Individuals with Visual Impairments (CATIS™) (ACVREP, 2024).\n\nMobility impairments\n\nWheelchairs\n\nWheelchairs are devices that can be manually propelled or electrically propelled, and that include a seating system and are designed to be a substitute for the normal mobility that most people have. Wheelchairs and other mobility devices allow people to perform mobility-related activities of daily living which include feeding, toileting, dressing, grooming, and bathing. The devices come in a number of variations where they can be propelled either by hand or by motors where the occupant uses electrical controls to manage motors and seating control actuators through a joystick, sip-and-puff control, head switches or other input devices. Often there are handles behind the seat for someone else to do the pushing or input devices for caregivers. Wheelchairs are used by people for whom walking is difficult or impossible due to illness, injury, or disability. Ambulatory wheelchair users may also use other devices, such as walkers. \nNewer advancements in wheelchair design enable wheelchairs to climb stairs, go off-road or propel using segway technology or additional add-ons like handbikes or power assists.\n\nTransfer devices\n\nPatient transfer devices generally allow patients with impaired mobility to be moved by caregivers between beds, wheelchairs, commodes, toilets, chairs, stretchers, shower benches, automobiles, swimming pools, and other patient support systems (i.e., radiology, surgical, or examining tables).\nThe most common devices are transfer benches, stretcher or convertible chairs (for lateral, supine transfer), sit-to-stand lifts (for moving patients from one seated position to another i.e., from wheelchairs to commodes), air bearing inflatable mattresses (for supine transfer i.e., transfer from a gurney to an operating room table), gait belts (or transfer belt) and a slider board (or transfer board), usually used for transfer from a bed to a wheelchair or from a bed to an operating table. Highly dependent patients who cannot assist their caregiver in moving them often require a patient lift (a floor or ceiling-suspended sling lift) which though invented in 1955 and in common use since the early 1960s is still considered the state-of-the-art transfer device by OSHA and the American Nursing Association.\n\nWalkers\nA walker or walking frame is a tool for people with disabilities who need additional support to maintain balance or stability while walking. It consists of a frame that is about waist high, approximately twelve inches deep and slightly wider than the user. Walkers are also available in other sizes, such as for children, or for heavy people. Modern walkers are height-adjustable. The front two legs of the walker may or may not have wheels attached depending on the strength and abilities of the person using it. It is also common to see caster wheels or glides on the back legs of a walker with wheels on the front. A walker with three or four wheels is often referred to as a Rollator.\n\nTreadmills\nBodyweight-supported treadmill training (BWSTT) is used to enhance walking ability of people with neurological injury. These machines are therapist-assisted devices that are used in the clinical setting, but is limited by the personnel and labor requirements placed on physical therapists.",
      "summary": "Assistive technology (AT) is a term for assistive, adaptive, and rehabilitative devices for people with disabilities and the elderly. People with disabilities often have difficulty performing activities of daily living (ADLs) independently, or even with assistance. ADLs are self-care activities that include toileting, mobility (ambulation), eating, bathing, dressing, grooming, and personal device care. Assistive technology can ameliorate the effects of disabilities that limit the ability to perf...",
      "categories": [
        "All articles with vague or ambiguous time",
        "Articles with short description",
        "Assistive technology",
        "CS1 Portuguese-language sources (pt)",
        "CS1 maint: multiple names: authors list",
        "CS1 maint: work parameter with ISBN",
        "Commons category link from Wikidata",
        "Educational technology",
        "Short description is different from Wikidata",
        "Use mdy dates from January 2020",
        "Vague or ambiguous time from February 2022",
        "Web accessibility",
        "Webarchive template wayback links"
      ],
      "source_type": "wikipedia",
      "disability_categories": [
        "adhd",
        "learning_disabilities"
      ],
      "fetched_at": "2026-02-02T13:31:12.517186"
    },
    {
      "id": "wiki_augmentative_and_alternative_communication",
      "title": "Augmentative and alternative communication",
      "url": "https://en.wikipedia.org/wiki/Augmentative_and_alternative_communication",
      "content": "Augmentative and alternative communication (AAC) encompasses the communication methods used to supplement or replace speech or writing for those with impairments in the production or comprehension of spoken or written language. AAC is used by those with a wide range of speech and language impairments, including developmental disabilities such as cerebral palsy, intellectual disability and autism, and acquired conditions such as amyotrophic lateral sclerosis and Parkinson's disease. AAC can be a permanent addition to a person's communication or a temporary aid. Stephen Hawking, probably the best-known user of AAC, had amyotrophic lateral sclerosis, and communicated through a speech-generating device.\nModern use of AAC began in the 1950s with systems for those who had lost the ability to speak following surgical procedures. During the 1960s and 1970s, spurred by an increasing commitment in the West towards the inclusion of disabled individuals in mainstream society and emphasis on them developing the skills required for independence, the use of manual sign language and then graphic symbol communication grew greatly. It was not until the 1980s that AAC began to emerge as a field in its own right. Rapid progress in technology, including microcomputers and speech synthesis, paved the way for communication devices with speech output, and multiple options for access to communication for those with physical disabilities.\nAAC systems are diverse: unaided communication uses no equipment and includes signing and body language, while aided approaches use external tools. Aided communication methods can range from paper and pencil to communication books or boards to speech generating devices (SGDs) or devices producing written output. The elements of communication used in AAC include gestures, photographs, pictures, line drawings, letters and words, which can be used alone or in combination. Body parts, pointers, adapted computer mice, or eye tracking can be used to select target symbols directly, and switch access scanning is often used for indirect selection. Message generation through AAC is generally much slower than spoken communication, and as a result rate enhancement techniques have been developed to reduce the number of selections required. These techniques include prediction, in which the user is offered guesses of the word/phrase being composed, and encoding, in which longer messages are retrieved using a prestored code.\nThe evaluation of a user's abilities and requirements for AAC will include the individual's motor, visual, cognitive, language and communication strengths and weaknesses. The evaluation requires the input of family members, particularly for early intervention. Respecting ethnicity and family beliefs are key to a family-centered and ethnically competent approach. Studies show that AAC use does not impede the development of speech, and may result in a modest increase in speech production. Users who have grown up with AAC report satisfying relationships and life activities; however, they may have poor literacy and are unlikely to be employed.\nWhile most AAC techniques controlled by the user are reliable, two techniques (facilitated communication and the rapid prompting method) have arisen which falsely claim to allow people with intellectual disabilities to communicate. These techniques involve an assistant (called a facilitator) guiding a disabled person to type on a keyboard or point at a letter board. It has been shown that the facilitator, rather than the disabled person, is the source of the messages generated in this way. There have been a large number of false allegations of sexual abuse made through facilitated communication.\nThe Convention on the Rights of Persons with Disabilities defines augmentative and alternative communication as forms of communication including languages as well as display of text, large-print, tactile communication, plain language, accessible multimedia and accessible information and communications technology.\nThe field was originally called \"Augmentative Communication\"; the term served to indicate that such communication systems were to supplement natural speech rather than to replace it. The addition of \"alternative\" followed later, when it became clear that for some individuals non-speech systems were their only means of communication. AAC communicators typically use a variety of aided and unaided communication strategies depending on the communication partners and the context. There were three, relatively independent, research areas in the 1960s and 1970s that lead to the field of augmentative and alternative communication. First was the work on early electromechanical communication and writing systems. The second was the development of communication and language boards, and lastly there was the research on ordinary (without disability) child language development.\n\nScope\nAugmentative and alternative communication is used by individuals to compensate for severe speech-language impairments in the expression or comprehension of spoken or written language. People making use of AAC include individuals with a variety of congenital conditions such as cerebral palsy, autism, intellectual disability, and acquired conditions such as amyotrophic lateral sclerosis, traumatic brain injury and aphasia. Prevalence data vary depending on the country and age/disabilities surveyed, but typically between 0.1 and 1.5% of the population are considered to have such severe speech-language impairments that they have difficulty making themselves understood, and thus could benefit from AAC. An estimated 0.05% of children and young people require high technology AAC. The bulky dedicated devices of the 1970s have evolved immensely while growing the ACC app industry. However, the continued high rates of limited use and abandonment highlight the need for a shift in design, while focusing on minimizing cognitive load and adapting to each user's unique language needs a long with their physical needs as well. Well-known AAC users include physicist Stephen Hawking, broadcaster Roger Ebert and poet Christopher Nolan. Award-winning films such as My Left Foot and The Diving Bell and the Butterfly, based on books by AAC users Christy Brown and Jean-Dominique Bauby respectively, have brought the lives of those who use AAC to a wider audience.\n\nForms of AAC\n\nUnaided AAC\n\nUnaided AAC systems are those that do not require an external tool, and include facial expression, vocalizations, gestures, and sign languages and systems. Informal vocalizations and gestures such as body language and facial expressions are part of natural communication, and such signals may be used by those with profound disabilities. More formalized gestural codes exist that lack a base in a naturally occurring language. For example, the Amer-Ind code is based on Plains Indian Sign Language, and has been used with children with severe-profound disabilities, and adults with a variety of diagnoses including dementia, aphasia and dysarthria. The benefits of gestures and pantomime are that they are always available to the user, usually understood by an educated listener, and are efficient means of communicating.\nIn contrast, sign languages have a linguistic base and permit the expression of an unlimited number of messages. Approaches to signing can be divided into two major categories, those that encode an existing language, and those that are languages in their own right. In the United States of America, Signing Exact English may be considered the most widely used example of the former and American Sign Language as a common example of the latter. Signing is used alone or in conjunction with speech to support communication with individuals with a variety of disorders. The specific hand shapes and movements of sign and gesture require an individual to have adequate fine motor and motor planning skills.",
      "summary": "Augmentative and alternative communication (AAC) encompasses the communication methods used to supplement or replace speech or writing for those with impairments in the production or comprehension of spoken or written language. AAC is used by those with a wide range of speech and language impairments, including developmental disabilities such as cerebral palsy, intellectual disability and autism, and acquired conditions such as amyotrophic lateral sclerosis and Parkinson's disease. AAC can be a ...",
      "categories": [
        "All articles containing potentially dated statements",
        "All articles with dead external links",
        "All articles with unsourced statements",
        "Articles containing potentially dated statements from April 2017",
        "Articles with dead external links from January 2025",
        "Articles with short description",
        "Articles with unsourced statements from March 2024",
        "Augmentative and alternative communication",
        "CS1 errors: missing periodical",
        "CS1 maint: DOI inactive as of January 2026",
        "CS1 maint: multiple names: authors list",
        "Good articles",
        "Short description is different from Wikidata",
        "Speech and language pathology"
      ],
      "source_type": "wikipedia",
      "disability_categories": [
        "autism",
        "adhd",
        "learning_disabilities",
        "intellectual"
      ],
      "fetched_at": "2026-02-02T13:31:14.064749"
    },
    {
      "id": "wiki_social_skills_training",
      "title": "Social skills",
      "url": "https://en.wikipedia.org/wiki/Social_skills",
      "content": "A social skill is any competence facilitating interaction and communication with others where social rules and relations are created, communicated, and changed in verbal and nonverbal ways. The process of learning these skills is called socialization. Lack of such skills can cause social awkwardness.\nInterpersonal skills are actions used to effectively interact with others. Interpersonal skills relate to categories of dominance vs. submission, love vs. hate, affiliation vs. aggression, and control vs. autonomy (Leary, 1957). Positive interpersonal skills include entertainment, persuasion, active listening, showing care, delegation, hospitality and stewardship, among others. Social psychology, an academic discipline focused on research relating to social functioning, studies how interpersonal skills are learned through societal-based changes in attitude, thinking, and behavior.\n\nEnumeration and categorization\nSocial skills are the tools that enable people to communicate, learn, ask for help, get needs met in appropriate ways, get along with others, make friends, develop healthy relationships, protect themselves, and in general, be able to interact with the society harmoniously. Social skills build essential character traits like trustworthiness, respectfulness, responsibility, fairness, caring, and citizenship. These traits help build an internal moral compass, allowing individuals to make good choices in thinking and behavior, resulting in social competence.\n\nThe important social skills identified by the Employment and Training Administration are:\n\nCoordination – Adjusting actions in relation to others' actions.\nMentoring – Teaching and helping others learn how to do something (e.g. being a study partner).\nNegotiation – Discussion aimed at reaching an agreement.\nPersuasion – The action or fact of persuading someone or of being persuaded to do or believe something.\nService orientation – Actively looking for ways to evolve compassionately and grow psycho-socially with people.\nSocial perceptiveness – Being aware of others' reactions and able to respond in an understanding manner.\nSocial skills are goal oriented with both main goals and sub-goals. For example, a workplace interaction initiated by a new employee with a senior employee will first contain a main goal. This will be to gather information, and then the sub-goal will be to establish a rapport in order to obtain the main goal. Takeo Doi in his study of consciousness distinguished this as tatemae, meaning conventions and verbal expressions and honne, meaning true motive behind the conventions.\n\nCauses of deficits\nDeficits in social skills were categorized by Gresham in 1998, as failure to recognize and reflect social skills, a failure to model appropriate models, and failure to perform acceptable behavior in particular situations in relation to developmental and transitional stages. Social skill deficits are also a discouragement for children with behavioral challenges when it comes to adult adjustment.\n\nAlcohol misuse\nSocial skills are often significantly impaired in people suffering from alcoholism. This is due to the neurotoxic long-term effects of alcohol misuse on the brain, especially the prefrontal cortex area of the brain. The social skills that are typically impaired by alcohol abuse, include impairments in perceiving facial emotions, prosody perception problems, and theory of mind deficits. The ability to understand humor is also often impaired in alcohol abusers. Impairments in social skills can also occur in individuals who have fetal alcohol spectrum disorders. These deficits persist throughout the affected people's lives, and may worsen over time due to the effects of aging on the brain.\n\nADHD and hyperkinetic disorder\nPeople with ADHD and hyperkinetic disorder often have difficulties with social skills, such as social interaction. Approximately half of children and adolescents with ADHD will experience peer rejection, compared to 10–15 percent of non-ADHD youth. Adolescents with ADHD are less likely to develop close friendships and romantic relationships; they are usually regarded by their peers as immature or as social outcasts, with an exception for peers that have ADHD or related conditions themselves, or a high level of tolerance for such symptoms. As they begin to mature, however, it becomes easier to make such relationships. Training in social skills, behavioral modification, and medication have some beneficial effects. Poor peer relationships can contribute to major depression, criminality, school failure, and substance use disorders.\n\nAutism spectrum disorder\nIndividuals with autism, including Asperger syndrome, are often characterized by their deficiency in social functioning. The concept of social skills has been questioned in terms of the autistic spectrum. In response to the needs of autistic children, Romanczyk has suggested adapting a comprehensive model of social acquisitions with behavioral modification rather than specific responses tailored for social contexts.\n\nAnxiety and depression\nIndividuals with few opportunities to socialize with others often struggle with social skills. This can often create a downward spiral effect for people with mental illnesses like anxiety or depression. Due to anxiety experienced from concerns with interpersonal evaluation and fear of negative reaction by others, surfeit expectations of failure or social rejection in socialization leads to avoiding or shutting down from social interactions. Individuals who experience significant levels of social anxiety often struggle when communicating with others, and may have impaired abilities to demonstrate social cues and behaviors appropriately.\nThe use of social media can also cause anxiety and depression. The Internet is causing many problems, according to a study with a sample size of 3,560 students. Problematic internet use may be present in about 4% of high school students in the United States, it may be associated with depression. About one fourth of respondents (28.51%) reported spending fifteen or more hours per week on the internet. Although other studies show positive effects from internet use.\n\nAnti-social behaviors\n\nThe authors of the book Snakes in Suits: When Psychopaths Go to Work explore psychopathy in workplace. The FBI consultants describe a five phase model of how a typical psychopath climbs to and maintains power. Many traits exhibited by these individuals include: superficial charm, insincerity, egocentricity, manipulativeness, grandiosity, lack of empathy, low agreeableness, exploitativeness, independence, rigidity, stubbornness and dictatorial tendencies. Babiak and Hare say for corporate psychopaths, success is defined as the best revenge and their problem behaviors are repeated \"ad infinitum\" due to little insight and their proto-emotions such as \"anger, frustration, and rage\" are refracted as irresistible charm. The authors note that lack of emotional literacy and moral conscience is often confused with toughness, the ability to make hard decisions, and effective crisis management. Babiak and Hare also emphasizes a reality they identified with psychopaths from studies that psychopaths are not able to be influenced by any sort of therapy.\nAt the University at Buffalo in New York, Emily Grijalva has investigated narcissism in business; she found there are two forms of narcissism: \"vulnerable\" and \"grandiose\". It is her finding that \"moderate\" level of grandiose narcissism is linked to becoming an effective manager. Grandiose narcissists are characterized as confident; they possess unshakable belief that they are superior, even when it is unwarranted. They can be charming, pompous show-offs, and can also be selfish, exploitative and entitled. Jens Lange and Jan Crusius at the University of Cologne, Germany associates \"malicious-benign\" envy within narcissistic social climbers in workplace.",
      "summary": "A social skill is any competence facilitating interaction and communication with others where social rules and relations are created, communicated, and changed in verbal and nonverbal ways. The process of learning these skills is called socialization. Lack of such skills can cause social awkwardness.\nInterpersonal skills are actions used to effectively interact with others. Interpersonal skills relate to categories of dominance vs. submission, love vs. hate, affiliation vs. aggression, and contr...",
      "categories": [
        "All articles lacking reliable references",
        "All articles with incomplete citations",
        "All articles with unsourced statements",
        "Articles lacking reliable references from December 2023",
        "Articles with incomplete citations from January 2024",
        "Articles with short description",
        "Articles with unsourced statements from June 2016",
        "Behaviorism",
        "Group processes",
        "Human communication",
        "Life skills",
        "Short description is different from Wikidata",
        "Social psychology",
        "Zoosemiotics"
      ],
      "source_type": "wikipedia",
      "disability_categories": [
        "learning_disabilities"
      ],
      "fetched_at": "2026-02-02T13:31:15.424203"
    },
    {
      "id": "wiki_direct_instruction",
      "title": "Direct instruction",
      "url": "https://en.wikipedia.org/wiki/Direct_instruction",
      "content": "Direct instruction (DI) is the explicit teaching of a skill set using lectures or demonstrations of the material to students. A particular subset, denoted by capitalization as Direct Instruction, refers to the approach developed by Siegfried Engelmann and Wesley C. Becker that was first implemented in the 1960s. DI teaches by explicit instruction, in contrast to exploratory models such as inquiry-based learning. DI includes tutorials, participatory laboratory classes, discussions, recitation, seminars, workshops, observation, active learning, practicum, or internships. The model incorporates the \"I do\" (instructor), \"We do\" (instructor and student/s), \"You do\" (student practices on their own with instructor monitoring) approach.\nDI relies on a systematic and scripted curriculum, delivered by highly trained instructors. On the premise that all students can learn and all teachers successfully teach if given effective training in specific techniques, teachers may be evaluated based on measurable student learning.\nIn some special education programs, direct instruction is used in resource rooms when teachers assist with homework completion and academic remediation.\n\nHistory\nDISTAR was a specific direct instruction model developed by Siegfried Engelmann and Wesley C. Becker. Engelmann and Becker sought to identify teaching methods that would accelerate the progress of historically disadvantaged elementary school students.\nDirect Instruction was first formally implemented at a preschool program for children from impoverished backgrounds at the University of Illinois in the mid-1960s. The team implementing DI consists of Siegfried Engelmann, Carl Bereiter, and Jean Osborn. The program incorporated short instructional periods, usually 20 to 30 minutes a day. The instructional periods focused on language, reading, and math. The children showed vast improvement, which led to further development of the approach. When further developing DI, they applied the same principles to create a formal instructional program that included language, reading, and math. The formal program was termed DISTAR, for Direct Instruction System for Teaching Arithmetic and Reading.\nIn the late 1960s, Project Follow Through included DI as one of the programs to compare the outcomes of over 20 different educational interventions in high-poverty communities. The study was a large government-funded study that was implemented over a multiyear period. DI was implemented at 19 different sites, which ranged in demographic and geographic characteristics. The results indicated that DI was the only intervention that had significantly positive impacts on all outcomes that were measured.\nDirect Instruction has been effectively delivered through peers to students with learning disabilities. Peer delivery offers teachers new ways to use the curriculum. The approach has also been examined as a model to assist students in a resource room with homework completion, bolster executive functioning skills, and improve teacher efficiency.\n\nSuccess for All\nAnother popular direct instruction approach is the Success for All program, which uses scripted teaching to instruct elementary children in phonics and intensive reading in their instruction program. What the teacher says is carefully scripted into the program. The program was designed by Johns Hopkins University professor Robert Slavin in the mid-1980s for failing schools in Baltimore, Maryland. The program requires a dedicated 90 minutes of reading instruction in which the teacher must follow a pre-ordained lesson plan that has every minute filled with scripted instruction and specific activities designed to teach reading. Not all experts were in favor of this instructional approach. For instance, Jonathan Kozol criticized the program in his book The Shame of the Nation for being excessively dogmatic, utilitarian, and authoritarian.\nEnglish Language Learners (ELL) students could also benefit from Direct Instruction. The program for teaching English to Spanish-speaking students begins with teachers giving instruction in Spanish and then gradually incorporating more and more English into the directions. As with all Direct Instruction programs, the Direct Instruction groups are kept small and commingled with others of similar skill levels.\n\nEffectiveness\nFeatures that make Direct Instruction effective:\n\nOnly 10% of the material is new, while the remaining 90% is a review of previously taught content.\nStudents are grouped based on their skill levels, which are determined by assessments administered before commencing the Direct Instruction program.\nThe emphasis is on the student's pace by either slowing down, reteaching, or accelerating through easily understood material.\nThe external validity of Direct Instruction has been tested, and the program is research-based.\nDebates about the efficacy of DI have raged before the final results of Project Follow Through were published; however, there is substantial empirical research supporting its effectiveness. A meta-analysis published by Adams and Engelmann (1996), a chief architect of the DI program, finds a \"mean effect size average per study...(as) more than .75, which confirms that the overall effect is substantial.\" A 2018 meta-analysis by Stockard et al. found an average effect on test scores of approximately 0.6 standard deviations.\nIn some special education programs, it is used in a resource room with small groups of students. Some research has shown there is benefit with this model.\nDirect Instruction is used with students from every population segment (with regard to poverty, culture, and race). In Project Follow Through, the DI model was ranked first in achievement for poor students, students who were not poor, urban students, rural students, African American students, Hispanic students, and Native American students. Today, many of the Bureau of Indian Affair's highest-performing schools use Direct Instruction materials. The Baltimore Curriculum Project has many schools with Free and Reduced Lunch Rates above 75% serving student populations that are more than 90% African American. These schools have shown strong achievement gains using Direct Instruction.\nMeta-analysis of 85 single-subject design studies comparing direct instruction to other teaching strategies found the effects to be substantial for students with learning disabilities; however, when qualified by IQ and reading levels, Strategy Instruction (SI) had better effects for the high IQ group. For the low-IQ discrepancy groups, higher effect sizes were yielded for a Combined DI and SI Model when compared to all competing models. With the exception of handwriting, DI's effects were all above 0.8 (i.e., reading and mathematics).\nJohn Hattie's Visible Learning: A Synthesis of Over 800 Meta-Analyses Relating to Achievement (2009) summarizes the results of four meta-analyses that examined Direct Instruction. These analyses incorporated 304 studies of over 42,000 students. Across all of these students, the average effect size was 0.59 and was significantly larger than those of any other curriculum Hattie studied.\nDirect Instruction is recognized as one of two effective models of comprehensive school reform and, in many cases, can be integrated into a tiered model system to address students with developing problems. The findings from Project Follow Through, conducted in a variety of selected communities throughout the United States, suggest that Direct Instruction is the most effective model for teaching academic skills and for affective outcomes (e.g. self-esteem) of children. Recent large-scale studies (1997–2003), such as the Baltimore Curriculum Project, show that it is possible to help schools that are in the lowest twenty percentile with respect to academic achievement steadily improve until they are performing well above average. In some cases, school achievement improved from the 16th percentile to above the 90th percentile.",
      "summary": "Direct instruction (DI) is the explicit teaching of a skill set using lectures or demonstrations of the material to students. A particular subset, denoted by capitalization as Direct Instruction, refers to the approach developed by Siegfried Engelmann and Wesley C. Becker that was first implemented in the 1960s. DI teaches by explicit instruction, in contrast to exploratory models such as inquiry-based learning. DI includes tutorials, participatory laboratory classes, discussions, recitation, se...",
      "categories": [
        "All articles needing additional references",
        "All articles with a promotional tone",
        "Articles needing additional references from January 2014",
        "Articles with a promotional tone from September 2021",
        "Articles with multiple maintenance issues",
        "Articles with short description",
        "Behaviorism",
        "Educational psychology",
        "Pedagogy",
        "Short description is different from Wikidata",
        "Webarchive template wayback links",
        "Wikipedia articles needing clarification from May 2016"
      ],
      "source_type": "wikipedia",
      "disability_categories": [
        "learning_disabilities"
      ],
      "fetched_at": "2026-02-02T13:31:16.792004"
    },
    {
      "id": "wiki_differentiated_instruction",
      "title": "Differentiated instruction",
      "url": "https://en.wikipedia.org/wiki/Differentiated_instruction",
      "content": "Differentiated instruction and assessment, also known as differentiated learning or, in education, simply, differentiation, is a framework or philosophy for effective teaching that involves providing students different avenues for understanding new information in terms of acquiring content, processing, constructing, or making sense of ideas, and developing teaching materials and assessment measures so that students can learn effectively regardless of differences in their ability.\nDifferentiated instruction means using different tools, content, and due process in order to successfully reach all individuals. According to Carol Ann Tomlinson, it is the process of \"ensuring that what a student learns, how he or she learns it, and how the student demonstrates what he or she has learned is a match for that student's readiness level, interests, and preferred mode of learning.\"\nAccording to Boelens et al., differentiation can be on two different levels; the administration level and the classroom level. The administration level takes the socioeconomic status and gender of students into consideration. At the classroom level, differentiation revolves around content, processing, product, and effects. On the content level, teachers adapt what they are teaching to meet the needs of students, which can mean making content more challenging or simplified for students based on their levels. The process of learning can be differentiated as well. Teachers may choose to teach one student at a time, or assign problems to small groups, partners or the whole group depending on the needs of the students. By differentiating the product, teachers can decide how students present what they have learned. This may take the form of videos, graphic organizers, photo presentations, writing, and oral presentations.\n\nWhen language is the factor for differentiation, the Sheltered Instruction Observation Protocol (SIOP) strongly supports and guides teachers to differentiate instruction in English as ESL learners who have a range of learning ability levels—beginning, intermediate and advanced. Here, differentiated instruction entails adapting a new instructional strategy that teachers of typical classrooms of native English speakers would have no need for.\nDifferentiated classrooms have also been described as responding to student variety in readiness levels, interests, and learning profiles. Such classrooms include all students and allow all of them to succeed. To do this, a teacher sets different expectations for task completion for students, specifically based upon their individual needs. Teachers can differentiate through content, process, product, and learning environment based on the individual learner. Differentiation stems from beliefs about differences among learners, how they learn, learning preferences, and individual interests, so it is therefore an organized and flexible way to proactively adjust teaching and learning methods to accommodate each child's learning needs and preferences in order to help them achieve maximum growth.\n\nPre-assessment\nPre-assessment is used to determine a student's knowledge, understanding and skill prior to the unit of study so that the coverage of mastered material and the use of ineffective methods are avoided. These are assessments for learning and include diagnostic or pre-assessments that teachers use to help guide instruction and benefit each learner. They are informal and provide qualitative feedback to teachers and students to address strengths and needs during the unit. Pre-assessments are to be conducted several weeks before the unit of study and are not to be graded.\nChapman and King (2005) note that when \"teachers strategically administer pre-assessments before planning their lessons, they can address the students' strengths and needs during instruction.\" Pre-assessment can be conducted in two ways:\n\nBy identifying learning preferences and interests (i.e. Gardner's Multiple Intelligence test, or Visual, Auditory, or Kinesthetic learner)\nBy identifying knowledge of students' understanding (i.e. checklists, quizzes, class discussion, portfolios, entry/exit cards, anticipation guides, journals, self-reflections)\nBoth of these types of pre-assessment are used to design student tasks, particularly when a student might require support, enrichment, or have different learning styles, intelligence, or interests.\n\nOngoing assessment\nAssessment is the process of gathering information from a variety of sources such as assignments, teacher observations, class discussions, and tests and quizzes. Assessment at regular intervals informs instructional strategies, gauges each student's readiness, interests, and learning preferences, and improves student learning. This information can be gathered through diagnostic (pre-assessments), formative, and summative assessments, as well as Individual Education Plans, Ontario Student Records, student interest surveys, and multiple intelligence or learning style inventories.\nAssessment for learning includes diagnostic (or pre-assessment) measures and formative assessment. Formative assessments are used during a unit to provide understanding about what the student is learning, and continually guide instructional decisions. Assessment as learning takes place when students self-assess their work and reflect on their growth as learners. Earl (2003) says this is the process in metacognition, and \"occurs when students personally monitor what they are learning and use feedback . . . to make adjustments, adaptations, and . . . changes in what they understand.\"\nDifferentiation can be used when applying, demonstrating, extending knowledge, or practicing skills and attitudes to monitor achievement of goals. This might include peer/self-assessments, and peer/teacher conferences. Assessment of learning is the culminating task or summative assessment, which takes place after the learning has occurred and students can show what concepts and/or skills they have learned. Differentiation can also be used through strategies such as tests, projects, demonstrations, and writing performances.\nAll these ongoing assessments help teachers know students and their needs so they can select effective teaching and learning strategies and interventions that maximize student achievement. Consistent program review and diagnosis of whole-class and individual student responses provide ongoing feedback to enhance teaching and learning for teachers, students, and parents. Teachers use ongoing assessments to gather information about a student's knowledge and capabilities, direct future planning, monitor student progress, and evaluate student achievement. Students and parents can also use these assessments to reflect and understand their own learning preferences and level of achievement.\n\nContent\nThe content of lessons may be differentiated based on what students already know. The most basic content of a lesson should cover the standards of learning set by the district or state. Some students in a class may be completely unfamiliar with the concepts in a lesson, some students may have partial mastery of the content or display mistaken ideas about the content, and some students may show mastery of the content before the lesson begins. The teacher may differentiate the content by designing activities for groups of students that cover different areas of Bloom's taxonomy. For example, students who are unfamiliar with the concepts may be required to complete tasks on the lower levels of Bloom's taxonomy: knowledge, comprehension, and application. Students with partial mastery may be asked to complete tasks in the application, analysis and evaluation areas, and students who have high levels of mastery may be asked to complete tasks in evaluation and synthesis.\nWhen teachers differentiate content, they may adapt what they want students to learn or how students gain knowledge, understanding, and skills.",
      "summary": "Differentiated instruction and assessment, also known as differentiated learning or, in education, simply, differentiation, is a framework or philosophy for effective teaching that involves providing students different avenues for understanding new information in terms of acquiring content, processing, constructing, or making sense of ideas, and developing teaching materials and assessment measures so that students can learn effectively regardless of differences in their ability.\nDifferentiated ...",
      "categories": [
        "Articles with short description",
        "CS1 errors: missing periodical",
        "CS1 maint: multiple names: authors list",
        "Educational practices",
        "Pedagogy",
        "Philosophy of education",
        "Short description is different from Wikidata",
        "Teaching",
        "Webarchive template wayback links"
      ],
      "source_type": "wikipedia",
      "disability_categories": [
        "general"
      ],
      "fetched_at": "2026-02-02T13:31:18.753898"
    },
    {
      "id": "wiki_functional_behavior_assessment",
      "title": "Functional behavior assessment",
      "url": "https://en.wikipedia.org/wiki/Functional_behavior_assessment",
      "content": "Functional behavior assessment (FBA) is an ongoing process of collecting information with a goal of identifying the environmental variables that control a problem or target behavior. The purpose of the assessment is to prove and aid the effectiveness of the interventions or treatments used to help eliminate the problem behavior. Through functional behavior assessments, we have learned that there are complex patterns to people's seemingly unproductive behaviors. It is important to not only pay attention to consequences that follow the behavior but also the antecedent that evokes the behavior. More work needs to be done in the future with functional assessment including balancing precision and efficiency, being more specific with variables involved and a more smooth transition from assessment to intervention.\n\nDefinition\nFunctional behavior assessment (FBA) is a method developed by applied behavior analysis (ABA) to identify the variables that maintain a problem behavior. Behavior is lawful. Whether it is desirable or undesirable, behavior is controlled by environmental variables. Behavior is a function of the antecedent and consequences that make up the three-term contingency. Functional assessment is the process of gathering information about the antecedent stimuli and consequences functional to the problem behavior. It attempts to provide an explanation to why the problem behavior may be occurring. The information about the antecedent stimuli may include the time and place, the presence of others and the frequency. The information collected helps identify which of the antecedent and consequences are maintaining the behavior. The information collected from functional assessment can also help develop appropriate treatments for the target behavior. Stimulus that may have been found to be reinforcing for the original behavior could be transferred to reinforce a more appropriate behavior.\n\nFunctions of problem behavior\nThe purpose of conducting a functional assessment is to identify the function of the target behavior. There are four main classes of functions of problem behavior.\n\nSocial positive reinforcement\nSocial positive reinforcement is when another person delivers a positive reinforcement after the problem behavior occurs. This is include the giving of attention, fun activities or goods and services provided by the person. An example of social positive reinforcement would be Max's mother (social) dropping what she is doing and provide attention (positive reinforcement) to her son when he engages in head banging on the wall (problem behavior).\n\nSocial negative reinforcement\nSocial negative reinforcement is when another person delivers a negative reinforcement after the problem behavior occurs. The person may terminate an aversive stimuli (interaction, task or activity) and the behavior is more likely to be maintained. An example of social negative reinforcement would be Max complains (problem behavior) to his parents (social) when he is asked to do chores, as a result, his parents allows him to escape the task (negative reinforcement).\n\nAutomatic positive reinforcement\nAutomatic positive reinforcement is when a positive reinforcement occurs automatically and is not mediated by another person. The behavior is strengthened by an automatic reinforcing consequence. An example of automatic positive reinforcement would be an autistic child waving his hands in front of his face (problem behavior) because the sensory stimulation (automatic positive reinforcement) produced is reinforcing for the child.\n\nAutomatic negative reinforcement\nAutomatic negative reinforcement is when a negative reinforcement occurs automatically reducing or eliminating an aversive stimulus as a reinforcing consequence of the behavior. A popular example of automatic negative reinforcement would be binge eating. Binge eating (problem behavior) had been found to temporarily reduce any unpleasant emotions the person may be experiencing before the binge (automatic negative reinforcement).\n\nAssessment methods\nThere are various different methods used to conduct functional assessment, all of which falls into three distinct categories.\n\nIndirect methods\nIndirect functional assessment methods use behavior interviews or surveys to gather information about the person exhibiting the behavior from themselves others who know this person well. The main advantage of indirect methods is they are easy and cheap to conduct and do not take much time. The main disadvantage of indirect methods is that the people involved are relying on their memories, thus some information may be lost or inaccurate.\nBecause of their convenience, indirect methods are used most commonly. It is essential assessment to be clear and objective as this will produce the most accurate answers without interpretation. The goal of the indirect assessment method is to generate information on the antecedent, behavior and consequence that can help generate a hypothesis about the variables that maintains the behavior.\nIndirect methods can help develop a correlation hypothesis but not a functional relationship.\n\nDirect observation methods\nDirect observation methods involve is present to observe and record the problem behavior as it occurs. The goal of direct observation is to record the immediate antecedent and consequences that functions with the problem behavior within a natural environment. The main advantage of direct observation is that the antecedents and consequences are recorded as it happens instead of recollection of memory. Therefore, the information recorded is generally more accurate. The main disadvantage of direct observation is it requires a considerable amount of time and effort to implement. Another thing about direct observation is, like indirect methods, it can only demonstrate a correlation but not a functional relationship.\nThe observer of the direct observation method should be present in the natural environment when the problem behavior is most likely to occur. The observer should also be trained to record the problem behavior and its functional antecedent and consequences immediately, correctly and objectively.\nDirect observation can also be an ABC observation. Together with indirect methods, direct and indirect assessments are categorized as descriptive assessment because the antecedent and consequences are described from with memory of events. The information collected aids the development of a hypothesis, but to demonstrate a functional relationship, one must use the experimental method.\n\nExperimental methods\nExperimental methods involve manipulating either the antecedent or consequent variables to determine their influence on the problem behavior. This is the only method that can demonstrate a functional relationship between the antecedent stimulus or the reinforcing consequence and the problem behavior. The main advantage of the experimental method is the demonstration of a functional relationship. The main disadvantage of the experimental method is the extensive use of time and effort to create an experiment.\nExperimental methods can also be called experimental analysis or functional analysis.\n\nConducting a functional assessment\nA functional assessment should always be conducted before treating a problem behavior. To develop appropriate treatment, one must have the correct information about the antecedents and consequences controlling the behavior because treatment involves manipulating these environmental events to evoke a change in the problem behavior. Here is the proper procedure to correctly implement a functional assessment.\n\nThe first step should start with a behavioral interview with the client or someone who knows him/her well.\nThe interview from the first step should help develop a hypothesis about which antecedent would produce the behavior and which reinforcing consequence would maintain it.",
      "summary": "Functional behavior assessment (FBA) is an ongoing process of collecting information with a goal of identifying the environmental variables that control a problem or target behavior. The purpose of the assessment is to prove and aid the effectiveness of the interventions or treatments used to help eliminate the problem behavior. Through functional behavior assessments, we have learned that there are complex patterns to people's seemingly unproductive behaviors. It is important to not only pay at...",
      "categories": [
        "Behavior modification",
        "Behavior therapy",
        "Behavioural sciences",
        "Disability",
        "Educational assessment and evaluation"
      ],
      "source_type": "wikipedia",
      "disability_categories": [
        "learning_disabilities",
        "emotional_behavioral"
      ],
      "fetched_at": "2026-02-02T13:31:20.197907"
    },
    {
      "id": "wiki_curriculum-based_measurement",
      "title": "Curriculum-based measurement",
      "url": "https://en.wikipedia.org/wiki/Curriculum-based_measurement",
      "content": "Curriculum-based measurement, or CBM, is also referred to as a general outcomes measures (GOMs) of a student's performance in either basic skills or content knowledge.\n\nEarly history\nCBM began in the mid-1970s with research headed by Stan Deno at the University of Minnesota. Over the course of 10 years, this work led to the establishment of measurement systems in reading, writing, and spelling that were: (a) easy to construct, (b) brief in administration and scoring, (c) had technical adequacy (reliability and various types of validity evidence for use in making educational decisions), and (d) provided alternate forms to allow time series data to be collected on student progress. This focus in the three language arts areas eventually was expanded to include mathematics, though the technical research in this area continues to lag that published in the language arts areas. An even later development was the application of CBM to middle-secondary areas: Espin and colleagues at the University of Minnesota developed a line of research addressing vocabulary and comprehension (with the maze) and by Tindal and colleagues at the University of Oregon developed a line of research on concept-based teaching and learning.\n\nIncreasing importance\nEarly research on the CBM quickly moved from monitoring student progress to its use in screening, normative decision-making, and finally benchmarking. Indeed, with the implementation of the No Child Left Behind Act in 2001, and its focus on large-scale testing and accountability, CBM has become increasingly important as a form of standardized measurement that is highly related to and relevant for understanding student's progress toward and achievement of state standards.\n\nKey feature\nProbably the key feature of CBM is its accessibility for classroom application and implementation. It was designed to provide an experimental analysis of the effects from interventions, which includes both instruction and curriculum. This is one of the most important conundrums to surface on CBM: To evaluate the effects of a curriculum, a measurement system needs to provide an independent \"audit\" and not be biased to only that which is taught. The early struggles in this arena referred to this difference as mastery monitoring (curriculum-based which was embedded in the curriculum and therefore forced the metric to be the number (and rate) of units traversed in learning) versus experimental analysis which relied on metrics like oral reading fluency (words read correctly per minute) and correct word or letter sequences per minute (in writing or spelling), both of which can serve as GOMs. In mathematics, the metric is often digits correct per minute. N.B. The metric of CBM is typically rate-based to focus on \"automaticity\" in learning basic skills.\n\nRecent advancements\nThe most recent advancements of CBM have occurred in three areas. First, they have been applied to students with low incidence disabilities. This work is best represented by Zigmond in the Pennsylvania Alternate Assessment and Tindal in the Oregon and Alaska Alternate Assessments. The second advancement is the use of generalizability theory with CBM, best represented by the work of John Hintze, in which the focus is parceling the error term into components of time, grade, setting, task, etc. Finally, Yovanoff, Tindal, and colleagues at the University of Oregon have applied Item Response Theory (IRT) to the development of statistically calibrated equivalent forms in their progress monitoring system.\n\nCritique\nCurriculum-based measurement emerged from behavioral psychology and yet several behaviorists have become disenchanted with the lack of the dynamics of the process.\n\nSee also\nResponse to Intervention\nSpecial Education\nNorm-referenced test\nList of state achievement tests in the U.S.\n\nReferences\n\nFurther reading\nFletcher, J.M.; Francis, D.J.; Morris, R.D. & Lyon, G.R. (2005). Evidence-based assessment of learning disabilities in children and adolescents. Journal of Clinical Child and Adolescent Psychology, 34(3), 506–22.\nFuchs, L.S. & Fuchs, D. (1999). Monitoring student progress toward the development of reading competence: A review of three forms of classroom-based assessment. School Psychology Review, 28(4), 659–71.\nHosp, M.; Hosp, J. & Howell, K. (2007). The ABCs of CBM: A Practical guide to curriculum-based measurement. New York: Guilford Press.\nMartínez, R.S.; Nellis, L.M. & Prendergast, K.A. (2006). Closing the achievement gap series: Part II: Response to intervention (RTI) – basic elements, practical applications, and policy recommendations (Education Policy Brief: Vol. 4, No. 11). Bloomington: Indiana University, School of Education, Center for Evaluation and Education Policy.\nJones, K.M. & Wickstrom, K.F. (2002). Done in sixty seconds: Further analysis of the brief assessment model for academic problems. School Psychology Review, 31(4), 554–68.\nShinn, M.R. (2002). Best practices in using curriculum-based measurement in a problem-solving model. In A. Thomas & J. Grimes (Eds.), Best Practices in School Psychology IV (pp. 671–93). Bethesda, MD: National Association of School Psychologists. ISBN 0-932955-85-1",
      "summary": "Curriculum-based measurement, or CBM, is also referred to as a general outcomes measures (GOMs) of a student's performance in either basic skills or content knowledge.\n\nEarly history\nCBM began in the mid-1970s with research headed by Stan Deno at the University of Minnesota. Over the course of 10 years, this work led to the establishment of measurement systems in reading, writing, and spelling that were: (a) easy to construct, (b) brief in administration and scoring, (c) had technical adequacy (...",
      "categories": [
        "Behaviorism",
        "Special education",
        "Student assessment and evaluation"
      ],
      "source_type": "wikipedia",
      "disability_categories": [
        "adhd",
        "learning_disabilities"
      ],
      "fetched_at": "2026-02-02T13:31:21.538834"
    }
  ]
}